<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class QuestionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
       
        $faker = Faker::create();

        DB::table('questions')->insert([
            'question' => 'كيف طريقة شراء سيارة؟',
            'answer'=> 'كيف طريقة شراء ستتم في البداية عملية شراء السيارة من خلال دفع عربون بقيمة 500 ريال, هذا العربون مخصوم من سعر السيارة الاجمالي و مسترد في حال عدم اتمام عملية الشراء شرط عدم تثبيت حجز السيارة.',
            'is_active' => '1',
        ]);
        DB::table('questions')->insert([
            'question' => 'كيف أدفع قيمة السيارة؟',
            'answer'=> 'كيف طريقة شراء ستتم في البداية عملية شراء السيارة من خلال دفع عربون بقيمة 500 ريال, هذا العربونيمكنك دفع باقي قيمة السيارة وذلك بعد تأكيد حجز السيارة مع موظف المبيعات المختص، ويكون ذلك بواسطة خدمة سداد السعودية وهي الأسهل والأسرع أو حوالة مصرفية لحساب الشركة لدى بنك الرياض. سيساعدك موظفينا في اجراء الدفع بكل يسر ان شاء الله',
            'is_active' => '1',
        ]);
        DB::table('questions')->insert([
            'question' => 'هل موقعكم معتمد من قبل وزارة التجارة؟',
            'answer'=> 'نعم! هذا الموقع موثق من وزارة التجارة والاستثمار وبدعم من شركة علم, بسجل تجاري رقم 1010538980.',
            'is_active' => '1',
        ]);
        DB::table('questions')->insert([
            'question' => 'ما هي خطوات شراء سيارة منكم؟',
            'answer'=> 'خطوات شراء سيارة 1. حجز السيارة تحجز السيارة التي تريدها بعربون بقيمة 500 ريال مسترد قبل تأكيد حجز السيارة،
            وخلال 24 ساعة من دفع العربون سيتواصل معك أحد موظفي قسم المبيعات المختص من شركة سيارة لتأكيد
            طلبك والتأكد انها متوفرة لدينا. 2. دفع باقي قيمة السيارة بعد التأكد من وجود السيارة مع موظف المبيعات
            المختص واعتماد السيارة من جهتك، يمكنك الآن القيام بتحويل باقي قيمة السيارة بواسطة خدمة سداد السعودية
            وهي الأسهل والأسرع أوالى حساب شركة سيارة لدى بنك الرياض. 3. تأمين السيارة بعد دفع قيمة السيارة يتم
            التأمين على سيارتك من خلال موظف المبيعات مباشرة، أو تزويدك بنسخة عن البطاقة الجمركية لتقوم بالتأمين على
            سيارتك ومن ثم تزويدنا بنسخة عن التأمين للانتقال بعد ذلك الى مرحلة تسجيل السيارة وإصدار الإستمارة. 4. تسجيل
            السيارة بعد دفع باقي قيمة السيارة وتأمينها نقوم باجراءات التسجيل لدى المرور لإصدار الاستمارة. 5. شحن سيارتك
            بعد التأكد من جاهزية سيارتك نقوم بإجراءات الشحن مباشرة الى مدينتك أو أقرب مدينة اليك أو الى باب منزلك مع
            رسوم شحن اضافية',
            'is_active' => '1',
        ]);
        DB::table('questions')->insert([
            'question' => 'ما هي الوثائق المطلوبة لشراء سيارة منكم؟',
            'answer'=> '1. صورة عن رخصة القيادة سارية المفعول. 2. صورة عن الهوية الشحصية.',
            'is_active' => '1',
        ]);
        DB::table('questions')->insert([
            'question' => 'هل موقعكم معتمد من قبل وزارة التجارة؟',
            'answer'=> 'نعم! هذا الموقع موثق من وزارة التجارة والاستثمار وبدعم من شركة علم, بسجل تجاري رقم 1010538980.',
            'is_active' => '1',
        ]);
        DB::table('questions')->insert([
            'question' => 'إجراءات التسجيل',
            'answer'=> 'بعد تحويل المبلغ لحساب الشركه يقوم الموظف المختص باجراءات التسجيل لدى المرور.',
            'is_active' => '1',
        ]);
        DB::table('questions')->insert([
            'question' => ' كيف أقوم بإستلام السيارة؟',
            'answer'=>'يتم استلام السيارة من خلال شركة سعيد البسامي للشحن بأقرب فرع لهم موجود في مدينتك, و سيتم تزويدك
            ببوليصة الشحن بالتاريخ المتوقع لاستلام السيارة.',
            'is_active' => '1',
        ]);
       
    }
}
