-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 28 مايو 2022 الساعة 08:49
-- إصدار الخادم: 10.4.18-MariaDB
-- PHP Version: 8.0.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `babor`
--

-- --------------------------------------------------------

--
-- بنية الجدول `auctions`
--

CREATE TABLE `auctions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `commission` int(11) DEFAULT NULL,
  `minInc` decimal(10,2) NOT NULL,
  `closeDate` date NOT NULL,
  `startDate` date DEFAULT NULL,
  `openingBid` decimal(10,2) NOT NULL,
  `reservePrice` decimal(20,2) NOT NULL,
  `winnerPrice` decimal(20,2) DEFAULT NULL,
  `rejectReason` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `next_url` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` enum('0','1','2','3','4','5') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `car_id` bigint(20) UNSIGNED NOT NULL,
  `auctioneer_id` bigint(20) UNSIGNED NOT NULL,
  `winner_id` bigint(20) UNSIGNED DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `auctions`
--

INSERT INTO `auctions` (`id`, `commission`, `minInc`, `closeDate`, `startDate`, `openingBid`, `reservePrice`, `winnerPrice`, `rejectReason`, `next_url`, `status`, `created_at`, `updated_at`, `car_id`, `auctioneer_id`, `winner_id`) VALUES
(1, NULL, '106.00', '2022-06-13', '2022-05-28', '980.00', '6507.00', NULL, NULL, NULL, '2', '2001-02-02 21:00:00', '2022-05-28 02:01:06', 1, 5, NULL),
(2, NULL, '267.00', '2022-06-27', '2022-06-27', '3175.00', '6549.00', NULL, NULL, NULL, '0', '1999-05-28 21:00:00', '2012-04-09 21:00:00', 2, 7, NULL),
(3, 326, '106.00', '2022-07-04', '2022-05-28', '3108.00', '6343.00', '3258.00', NULL, 'http://waslpayment.com/api/v1/merchant/do_payment_order/eXqp3xlTI1', '5', '1992-10-19 21:00:00', '2022-05-28 03:07:20', 3, 8, 4),
(4, NULL, '129.00', '2022-07-11', '2022-05-28', '909.00', '6291.00', NULL, NULL, NULL, '2', '1974-02-01 21:00:00', '2022-05-28 02:01:00', 4, 2, NULL),
(5, NULL, '249.00', '2022-07-25', '2022-05-28', '1427.00', '5274.00', NULL, NULL, NULL, '2', '1988-09-18 21:00:00', '2022-05-28 02:00:57', 5, 4, NULL),
(6, NULL, '250.00', '2022-08-08', '2022-05-28', '3636.00', '6528.00', NULL, NULL, NULL, '2', '1986-01-06 21:00:00', '2022-05-28 02:00:54', 6, 6, NULL),
(7, NULL, '284.00', '2022-08-15', '2022-05-28', '1299.00', '5227.00', NULL, NULL, NULL, '2', '1980-06-20 21:00:00', '2022-05-28 02:00:52', 7, 6, NULL),
(8, 542, '300.00', '2022-08-29', '2022-05-28', '5000.00', '4499.00', '5420.00', NULL, 'http://waslpayment.com/api/v1/merchant/do_payment_order/qHwSRrzBCd', '5', '2007-11-21 21:00:00', '2022-05-28 03:20:21', 8, 8, 4),
(9, NULL, '261.00', '2022-09-12', '2022-05-28', '2282.00', '4793.00', NULL, NULL, NULL, '2', '1986-09-30 21:00:00', '2022-05-28 02:00:45', 9, 6, NULL),
(10, NULL, '297.00', '2022-09-19', '2022-05-28', '1064.00', '5116.00', NULL, NULL, NULL, '2', '2011-07-30 21:00:00', '2022-05-28 02:00:43', 10, 10, NULL),
(11, NULL, '263.00', '2022-10-03', '2022-05-28', '1128.00', '4116.00', NULL, NULL, NULL, '2', '1978-03-04 21:00:00', '2022-05-28 02:00:39', 11, 6, NULL),
(12, NULL, '342.00', '2022-10-10', '2022-05-28', '3090.00', '4369.00', NULL, NULL, NULL, '2', '1997-06-19 21:00:00', '2022-05-28 02:00:37', 12, 5, NULL),
(13, NULL, '168.00', '2022-10-24', '2022-05-28', '1439.00', '5900.00', NULL, NULL, NULL, '2', '1981-08-11 21:00:00', '2022-05-28 02:00:34', 13, 6, NULL),
(14, NULL, '178.00', '2022-11-07', '2022-05-28', '3651.00', '5559.00', NULL, NULL, NULL, '2', '1971-11-14 21:00:00', '2022-05-28 02:00:28', 14, 9, NULL),
(15, NULL, '344.00', '2022-11-21', '2022-05-28', '3029.00', '4775.00', NULL, NULL, NULL, '2', '2013-10-20 21:00:00', '2022-05-28 02:00:30', 15, 3, NULL),
(16, NULL, '212.00', '2022-12-05', '2022-05-28', '2131.00', '4163.00', NULL, NULL, NULL, '2', '2013-01-08 21:00:00', '2022-05-28 02:00:04', 16, 6, NULL),
(17, NULL, '112.00', '2022-12-12', '2022-05-28', '420.00', '5282.00', NULL, NULL, NULL, '2', '1973-10-18 21:00:00', '2022-05-28 02:00:10', 17, 9, NULL),
(18, NULL, '196.00', '2022-12-26', '2022-05-28', '651.00', '4013.00', NULL, NULL, NULL, '2', '1993-07-26 21:00:00', '2022-05-28 01:59:58', 18, 7, NULL),
(19, NULL, '294.00', '2023-01-09', '2023-01-09', '2616.00', '6544.00', NULL, NULL, NULL, '0', '1981-11-12 21:00:00', '1995-06-22 21:00:00', 19, 8, NULL),
(20, NULL, '148.00', '2023-01-23', '2023-01-23', '3502.00', '4115.00', NULL, NULL, NULL, '0', '2012-06-25 21:00:00', '1994-07-12 21:00:00', 20, 9, NULL),
(21, NULL, '239.00', '2023-02-06', '2023-02-06', '3748.00', '4887.00', NULL, NULL, NULL, '0', '2003-07-21 21:00:00', '2005-07-14 21:00:00', 21, 5, NULL),
(22, NULL, '219.00', '2023-02-20', '2023-02-20', '1296.00', '4488.00', NULL, NULL, NULL, '0', '1983-02-12 21:00:00', '2006-11-01 21:00:00', 22, 3, NULL);

-- --------------------------------------------------------

--
-- بنية الجدول `bids`
--

CREATE TABLE `bids` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `currentPrice` decimal(20,2) NOT NULL,
  `bidPrice` decimal(10,2) NOT NULL,
  `securityDeposit` int(11) DEFAULT NULL,
  `refund` tinyint(1) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `bidder_id` bigint(20) UNSIGNED NOT NULL,
  `auction_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `bids`
--

INSERT INTO `bids` (`id`, `currentPrice`, `bidPrice`, `securityDeposit`, `refund`, `created_at`, `updated_at`, `bidder_id`, `auction_id`) VALUES
(1, '3258.00', '150.00', 10, 1, '2022-05-28 03:01:38', '2022-05-28 03:03:01', 4, 3),
(2, '5420.00', '420.00', 10, 1, '2022-05-28 03:12:57', '2022-05-28 03:13:41', 4, 8);

-- --------------------------------------------------------

--
-- بنية الجدول `brands`
--

CREATE TABLE `brands` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `logo` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT 'default.png',
  `is_active` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `brands`
--

INSERT INTO `brands` (`id`, `name`, `logo`, `is_active`, `created_at`, `updated_at`) VALUES
(1, 'فورد', '0', 1, '2015-09-12 21:00:00', '2004-09-28 21:00:00'),
(2, 'تويوتا', '0', 1, '1974-12-10 21:00:00', '1976-04-03 21:00:00'),
(3, 'GMC', '0', 1, '1990-01-05 21:00:00', '2013-02-20 21:00:00'),
(4, 'هونداي', '0', 1, '1987-08-26 21:00:00', '1981-06-23 21:00:00'),
(5, 'نيسان', '0', 1, '2011-10-14 21:00:00', '1980-03-01 21:00:00'),
(6, 'مرسيدس', '0', 1, '1990-09-07 21:00:00', '1990-04-22 21:00:00'),
(7, 'شفروليه', '0', 1, '1996-04-20 21:00:00', '2008-10-06 21:00:00'),
(8, 'كينج لونج', '0', 1, '1985-09-22 21:00:00', '1975-02-28 21:00:00'),
(9, 'ايسوزو', '0', 1, '1995-01-10 21:00:00', '1973-01-04 21:00:00');

-- --------------------------------------------------------

--
-- بنية الجدول `cars`
--

CREATE TABLE `cars` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `jear` enum('0','1') COLLATE utf8mb4_unicode_ci NOT NULL,
  `model` int(11) NOT NULL,
  `color` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `sizOfDamage` enum('0','1','2','3') COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` enum('0','1') COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `numberOfKillos` decimal(8,2) NOT NULL,
  `thumbnail` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `car_images` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `carPosition` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` longtext COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `brand_id` bigint(20) UNSIGNED NOT NULL,
  `category_id` bigint(20) UNSIGNED NOT NULL,
  `series_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `cars`
--

INSERT INTO `cars` (`id`, `jear`, `model`, `color`, `sizOfDamage`, `status`, `numberOfKillos`, `thumbnail`, `car_images`, `carPosition`, `description`, `created_at`, `updated_at`, `brand_id`, `category_id`, `series_id`) VALUES
(1, '0', 2019, 'أبيض', NULL, '0', '133185.00', 'car1.PNG', '[\"car12.PNG\",\"car13.PNG\",\"car14.PNG\",\"car14.PNG\",\"car15.PNG\",\"car16.PNG\"]', 'تعز ، الروضه ', 'ستاندرد', NULL, NULL, 5, 1, 1),
(2, '1', 2017, 'رمادي', NULL, '1', '0.00', 'car2.PNG', '[\"car22.PNG\",\"car23.PNG\",\"car24.PNG\",\"car25.PNG\"]', 'تعز ، الحوبان', 'نص فل دبل', NULL, NULL, 5, 1, 4),
(3, '1', 2017, 'أبيض', NULL, '0', '152276.00', 'car3.PNG', '[\"car31.PNG\",\"car32.PNG\",\"car33.PNG\",\"car34.PNG\",\"car35.PNG\"]', 'Tenetur ut quis ab dolor aut corporis temporibus.', 'نص فل', NULL, NULL, 7, 1, 2),
(4, '1', 2019, 'أسود', NULL, '0', '98794.00', 'car4.PNG', '[\"car41.PNG\",\"car42.PNG\",\"car43.PNG\",\"car44.PNG\"]', 'البيضاء ، شارع النور', 'ستاندر', NULL, NULL, 1, 1, 3),
(5, '0', 2006, 'أخضر', NULL, '1', '0.00', 'bus12.png', '[\"bus1.png\",\"bus13.png\",\"bus14.png\",\"bus15.png\"]', 'صنعاء ، شارع جمال ', 'ميني باص', NULL, NULL, 6, 4, 5),
(6, '0', 2010, 'أحمر', NULL, '1', '0.00', 'bus2.png', '[\"bus21.png\",\"bus2.png\"]', 'اب ، شارع العدين', ' باص سياحي هيونداي مستعمل أحمر 2010', NULL, NULL, 4, 4, 6),
(7, '0', 2013, 'أزرق', NULL, '1', '0.00', 'bus3.png', '[\"bus31.png\",\"bus32.png\",\"bus33.png\",\"bus34.png\"]', 'تعز ، شارع المسبح', 'باص سياحي كينج لونج', NULL, NULL, 8, 4, 6),
(8, '0', 2017, 'أبيض', NULL, '1', '0.00', 'bus4.jpg', '[\"bus41.jpg\",\"bus42.jpg\",\"bus43.png\"]', 'تعز ، شارع  العقبه', 'اشوك لاند موديل ٢٠١٥ موديل ٢٠١٧ موديل ٢٠١٨ يوجد عدد ٥٦ راكب ويوجد عدد ٦٠ راكب مع الساق', NULL, NULL, 8, 4, 7),
(9, '1', 2000, 'أبيض', NULL, '1', '0.00', 'fan1.jpg', '[\"fan11.jpg\",\"fan12.jpg\",\"fan13.jpg\",\"fan14.jpg\"]', 'شبوه ، شارع الاجيال', 'البي اتكو موديل 99 815 طبعه لوجستيه الطول سته وربع ارتفاع285 زجاج كهرباء شاشه مع كاميرا السياره نضيفا جدااا 0795215221', NULL, NULL, 6, 3, 8),
(10, '1', 2001, 'أبيض', NULL, '0', '5000.00', 'fan2.jpg', '[\"fan21.jpg\",\"fan22.jpg\",\"fan23.jpg\",\"fan24.jpg\"]', 'صعده ، شارع المنار', 'البي اتكو موديل 99 815 طبعه لوجستيه الطول سته وربع ارتفاع285 زجاج كهرباء شاشه مع كاميرا السياره نضيفا جدااا 0795215221', NULL, NULL, 6, 3, 8),
(11, '1', 2003, 'أبيض', NULL, '0', '5000.00', 'fan4.jpg', '[\"fan41.jpg\",\"fan42.jpg\"]', 'عدن ، شارع الزهره', 'سطحة مع جوانب', NULL, NULL, 8, 3, 10),
(12, '1', 2008, 'أبيض', NULL, '0', '23490.00', 'fan3.jpg', '[\"fan31.jpg\"]', 'حضرموت ، شارع المظفر ', 'وايت صرف صحي', NULL, NULL, 9, 3, 9),
(13, '0', 2000, 'كاكي', NULL, '1', '0.00', 'toyota_land_cruiser_4.webp', '[\"toyota_land_cruiser_3.webp\",\"toyota_land_cruiser_2.webp\",\"toyota_land_cruiser_1.webp\"]', 'تعز ، شارع الحوض', 'سياره ذاتيه القياديه', NULL, NULL, 4, 3, 3),
(14, '0', 2007, 'كحلي', NULL, '1', '0.00', 'hyundai_accent_1.webp', '[\"hyundai_accent_2.webp\",\"hyundai_accent_3.webp\",\"hyundai_accent_4.webp\"]', 'اب ، شارع النجد', 'سياره ذات محرك دفع خلفي', NULL, NULL, 5, 1, 1),
(15, '0', 2003, 'رصاصي', NULL, '0', '500000.00', 'hyundai_creta_1.webp', '[\"hyundai_creta_2.webp\",\"hyundai_creta_3.webp\",\"hyundai_creta_4.webp\"]', 'عدن ، شارع المكلا', 'سياره كهربائيه ', NULL, NULL, 5, 1, 1),
(16, '1', 2003, 'أبيض', NULL, '0', '670000.00', 'daihatsu_gran_3.webp', '[\"daihatsu_gran_1.webp\",\"daihatsu_gran_2.webp\",\"daihatsu_gran_4.webp\"]', 'اب ، شارع المكلا', 'سياره ذات دفع امامي', NULL, NULL, 5, 4, 1),
(17, '0', 2013, 'أبيض', NULL, '1', '34000.00', 'volvo_fh_1.jpg', '[\"volvo_fh_2.jpg\",\"volvo_fh_3.jpg\",\"volvo_fh_4.jpg\"]', 'صنعاء ، شارع حده ', 'شاحنه بمعزز تربو', NULL, NULL, 5, 3, 4),
(18, '1', 2001, 'رصاصي', NULL, '0', '320000.00', 'volvo_fh16_1.jpg', '[\"volvo_fh16_2.jpg\",\"volvo_fh16_3.jpg\",\"volvo_fh16_4.jpg\"]', 'الضالع ، شارع الجير', 'راس شاحنه بحاله جيده', NULL, NULL, 3, 3, 2),
(19, '0', 2017, 'رصاصي', NULL, '0', '280000.00', 'volvo_fh16_1.jpg', '[\"volvo_fh16_2.jpg\",\"volvo_fh16_3.jpg\",\"volvo_fh16_4.jpg\"]', 'الضالع ، شارع الجير', 'اقتصاديه في استهلاك الوقود', NULL, NULL, 3, 3, 1),
(20, '0', 2019, 'رصاصي', NULL, '1', '0.00', 'taxi4.jpg', '[\"taxi1.jpg\",\"taxi2.jpg\",\"taxi3.jpg\"]', 'عدن ، شارع الجير', 'ذات صوت هادئ', NULL, NULL, 5, 2, 1),
(21, '0', 2009, 'رصاصي', NULL, '1', '0.00', 'taxi8.jpg', '[\"taxi7.jpg\",\"taxi5.jpg\",\"taxi6.jpg\"]', 'اب ، شارع الجير', 'ذات صوت هادئ', NULL, NULL, 1, 2, 4),
(22, '0', 2002, 'رصاصي', NULL, '0', '50000.00', 'taxi9.jpg', '[\"taxi10.jpg\",\"taxi11.jpg\",\"taxi12.jpg\"]', 'لحج ، شارع النورين', 'ذات صوت هادئ', NULL, NULL, 4, 2, 4);

-- --------------------------------------------------------

--
-- بنية الجدول `categories`
--

CREATE TABLE `categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `categories`
--

INSERT INTO `categories` (`id`, `name`, `image`, `is_active`, `created_at`, `updated_at`) VALUES
(1, 'سيارة', '0', 1, NULL, NULL),
(2, 'تاكسي', '0', 1, NULL, NULL),
(3, 'شاحنة', '0', 1, NULL, NULL),
(4, 'حافلة', '0', 1, NULL, NULL);

-- --------------------------------------------------------

--
-- بنية الجدول `contact_us`
--

CREATE TABLE `contact_us` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `message` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `phone` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- بنية الجدول `contracts`
--

CREATE TABLE `contracts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `buyer_confirm` tinyint(1) DEFAULT NULL,
  `seller_confirm` tinyint(1) DEFAULT NULL,
  `buyer_undoReason` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `payment_bill_id` bigint(20) UNSIGNED DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `contracts`
--

INSERT INTO `contracts` (`id`, `buyer_confirm`, `seller_confirm`, `buyer_undoReason`, `created_at`, `updated_at`, `payment_bill_id`) VALUES
(1, 1, 1, NULL, '2022-05-28 03:06:36', '2022-05-28 03:07:20', 1),
(2, 0, 1, 'سبب شخصي', '2022-05-28 03:15:06', '2022-05-28 03:18:32', 2);

-- --------------------------------------------------------

--
-- بنية الجدول `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- بنية الجدول `favorites`
--

CREATE TABLE `favorites` (
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `auction_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `favorites`
--

INSERT INTO `favorites` (`user_id`, `auction_id`, `created_at`, `updated_at`) VALUES
(3, 1, '2022-05-28 02:52:13', '2022-05-28 02:52:13'),
(3, 14, '2022-05-28 02:51:51', '2022-05-28 02:51:51'),
(3, 15, '2022-05-28 02:52:07', '2022-05-28 02:52:07'),
(4, 4, '2022-05-28 02:53:45', '2022-05-28 02:53:45'),
(4, 14, '2022-05-28 02:53:43', '2022-05-28 02:53:43'),
(4, 15, '2022-05-28 02:53:43', '2022-05-28 02:53:43');

-- --------------------------------------------------------

--
-- بنية الجدول `messages`
--

CREATE TABLE `messages` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `message` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `receiver_id` int(11) DEFAULT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- بنية الجدول `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1331, '2014_10_12_000000_create_users_table', 1),
(1332, '2014_10_12_100000_create_password_resets_table', 1),
(1333, '2018_11_06_222923_create_transactions_table', 1),
(1334, '2018_11_07_192923_create_transfers_table', 1),
(1335, '2018_11_15_124230_create_wallets_table', 1),
(1336, '2019_08_19_000000_create_failed_jobs_table', 1),
(1337, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(1338, '2021_11_02_202021_update_wallets_uuid_table', 1),
(1339, '2022_04_20_220634_laratrust_setup_tables', 1),
(1340, '2022_04_21_155249_create_profiles_table', 1),
(1341, '2022_04_21_155422_add_user_id_field_to_profile', 1),
(1342, '2022_04_21_231109_create_services_table', 1),
(1343, '2022_04_25_023855_create_brands_table', 1),
(1344, '2022_04_25_082541_create_series_table', 1),
(1345, '2022_04_27_163331_create_categories_table', 1),
(1346, '2022_04_28_121205_add_brand_id_field_to_series', 1),
(1347, '2022_04_28_121657_create_cars_table', 1),
(1348, '2022_04_28_122849_create_auctions_table', 1),
(1349, '2022_04_28_123156_create_bids_table', 1),
(1350, '2022_04_28_123604_add_brand_id_field_to_cars', 1),
(1351, '2022_04_28_123627_add_category_id_field_to_cars', 1),
(1352, '2022_04_28_124650_add_series_id_field_to_cars', 1),
(1353, '2022_04_28_125246_add_car_id_field_to_auctions', 1),
(1354, '2022_05_03_171552_add_bidder_id_field_to_bids', 1),
(1355, '2022_05_03_171823_add_auctioneer_id_field_to_auctions', 1),
(1356, '2022_05_03_172028_add_auction_id_field_to_bids', 1),
(1357, '2022_05_09_090547_create_questions_table', 1),
(1358, '2022_05_10_095714_create_notifications_table', 1),
(1359, '2022_05_13_175827_create_messages_table', 1),
(1360, '2022_05_13_182436_add_winner_id_field_to_auctions', 1),
(1361, '2022_05_14_145855_add_user_id_to_messages', 1),
(1362, '2022_05_15_152654_create_payment_bills_table', 1),
(1363, '2022_05_15_153229_add_bid_id_field_to_payment_bills', 1),
(1364, '2022_05_15_155633_create_contact_us_table', 1),
(1365, '2022_05_16_162848_create_contracts_table', 1),
(1366, '2022_05_16_163259_add_payment_bill_id_field_to_contracts', 1),
(1367, '2022_05_16_202741_create_review_ratings_table', 1),
(1368, '2022_05_20_114839_create_favorites_table', 1);

-- --------------------------------------------------------

--
-- بنية الجدول `notifications`
--

CREATE TABLE `notifications` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `state` tinyint(4) NOT NULL,
  `message` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `link` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `thumbnail` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `price` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `closeDate` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `notifications`
--

INSERT INTO `notifications` (`id`, `created_at`, `updated_at`, `user_id`, `state`, `message`, `link`, `type`, `thumbnail`, `price`, `closeDate`) VALUES
(1, '2022-05-28 01:59:58', '2022-05-28 02:18:49', 2, 0, 'تمت إضافة مزاد جديد', '18', '1', 'volvo_fh16_1.jpg', '651.00', '2022-12-26'),
(2, '2022-05-28 01:59:58', '2022-05-28 02:19:00', 3, 0, 'تمت إضافة مزاد جديد', '18', '1', 'volvo_fh16_1.jpg', '651.00', '2022-12-26'),
(3, '2022-05-28 01:59:58', '2022-05-28 01:59:58', 4, 1, 'تمت إضافة مزاد جديد', '18', '1', 'volvo_fh16_1.jpg', '651.00', '2022-12-26'),
(4, '2022-05-28 01:59:58', '2022-05-28 01:59:58', 5, 1, 'تمت إضافة مزاد جديد', '18', '1', 'volvo_fh16_1.jpg', '651.00', '2022-12-26'),
(5, '2022-05-28 01:59:58', '2022-05-28 02:17:21', 6, 0, 'تمت إضافة مزاد جديد', '18', '1', 'volvo_fh16_1.jpg', '651.00', '2022-12-26'),
(6, '2022-05-28 01:59:58', '2022-05-28 01:59:58', 7, 1, 'لقد تمت الموافقة على مزادك', '18', '2', 'volvo_fh16_1.jpg', '651.00', '2022-12-26'),
(7, '2022-05-28 01:59:58', '2022-05-28 01:59:58', 8, 1, 'تمت إضافة مزاد جديد', '18', '1', 'volvo_fh16_1.jpg', '651.00', '2022-12-26'),
(8, '2022-05-28 01:59:58', '2022-05-28 01:59:58', 9, 1, 'تمت إضافة مزاد جديد', '18', '1', 'volvo_fh16_1.jpg', '651.00', '2022-12-26'),
(9, '2022-05-28 01:59:58', '2022-05-28 01:59:58', 10, 1, 'تمت إضافة مزاد جديد', '18', '1', 'volvo_fh16_1.jpg', '651.00', '2022-12-26'),
(10, '2022-05-28 02:00:04', '2022-05-28 02:18:49', 2, 0, 'تمت إضافة مزاد جديد', '16', '1', 'daihatsu_gran_3.webp', '2131.00', '2022-12-05'),
(11, '2022-05-28 02:00:04', '2022-05-28 02:19:00', 3, 0, 'تمت إضافة مزاد جديد', '16', '1', 'daihatsu_gran_3.webp', '2131.00', '2022-12-05'),
(12, '2022-05-28 02:00:04', '2022-05-28 02:00:04', 4, 1, 'تمت إضافة مزاد جديد', '16', '1', 'daihatsu_gran_3.webp', '2131.00', '2022-12-05'),
(13, '2022-05-28 02:00:04', '2022-05-28 02:00:04', 5, 1, 'تمت إضافة مزاد جديد', '16', '1', 'daihatsu_gran_3.webp', '2131.00', '2022-12-05'),
(14, '2022-05-28 02:00:04', '2022-05-28 02:17:21', 6, 0, 'لقد تمت الموافقة على مزادك', '16', '2', 'daihatsu_gran_3.webp', '2131.00', '2022-12-05'),
(15, '2022-05-28 02:00:04', '2022-05-28 02:00:04', 7, 1, 'تمت إضافة مزاد جديد', '16', '1', 'daihatsu_gran_3.webp', '2131.00', '2022-12-05'),
(16, '2022-05-28 02:00:04', '2022-05-28 02:00:04', 8, 1, 'تمت إضافة مزاد جديد', '16', '1', 'daihatsu_gran_3.webp', '2131.00', '2022-12-05'),
(17, '2022-05-28 02:00:04', '2022-05-28 02:00:04', 9, 1, 'تمت إضافة مزاد جديد', '16', '1', 'daihatsu_gran_3.webp', '2131.00', '2022-12-05'),
(18, '2022-05-28 02:00:04', '2022-05-28 02:00:04', 10, 1, 'تمت إضافة مزاد جديد', '16', '1', 'daihatsu_gran_3.webp', '2131.00', '2022-12-05'),
(19, '2022-05-28 02:00:10', '2022-05-28 02:18:49', 2, 0, 'تمت إضافة مزاد جديد', '17', '1', 'volvo_fh_1.jpg', '420.00', '2022-12-12'),
(20, '2022-05-28 02:00:10', '2022-05-28 02:19:00', 3, 0, 'تمت إضافة مزاد جديد', '17', '1', 'volvo_fh_1.jpg', '420.00', '2022-12-12'),
(21, '2022-05-28 02:00:10', '2022-05-28 02:00:10', 4, 1, 'تمت إضافة مزاد جديد', '17', '1', 'volvo_fh_1.jpg', '420.00', '2022-12-12'),
(22, '2022-05-28 02:00:10', '2022-05-28 02:00:10', 5, 1, 'تمت إضافة مزاد جديد', '17', '1', 'volvo_fh_1.jpg', '420.00', '2022-12-12'),
(23, '2022-05-28 02:00:10', '2022-05-28 02:17:21', 6, 0, 'تمت إضافة مزاد جديد', '17', '1', 'volvo_fh_1.jpg', '420.00', '2022-12-12'),
(24, '2022-05-28 02:00:10', '2022-05-28 02:00:10', 7, 1, 'تمت إضافة مزاد جديد', '17', '1', 'volvo_fh_1.jpg', '420.00', '2022-12-12'),
(25, '2022-05-28 02:00:10', '2022-05-28 02:00:10', 8, 1, 'تمت إضافة مزاد جديد', '17', '1', 'volvo_fh_1.jpg', '420.00', '2022-12-12'),
(26, '2022-05-28 02:00:10', '2022-05-28 02:00:10', 9, 1, 'لقد تمت الموافقة على مزادك', '17', '2', 'volvo_fh_1.jpg', '420.00', '2022-12-12'),
(27, '2022-05-28 02:00:10', '2022-05-28 02:00:10', 10, 1, 'تمت إضافة مزاد جديد', '17', '1', 'volvo_fh_1.jpg', '420.00', '2022-12-12'),
(28, '2022-05-28 02:00:24', '2022-05-28 02:18:49', 2, 0, 'تمت إضافة مزاد جديد', '14', '1', 'hyundai_accent_1.webp', '3651.00', '2022-11-07'),
(29, '2022-05-28 02:00:26', '2022-05-28 02:19:00', 3, 0, 'تمت إضافة مزاد جديد', '14', '1', 'hyundai_accent_1.webp', '3651.00', '2022-11-07'),
(30, '2022-05-28 02:00:26', '2022-05-28 02:00:26', 4, 1, 'تمت إضافة مزاد جديد', '14', '1', 'hyundai_accent_1.webp', '3651.00', '2022-11-07'),
(31, '2022-05-28 02:00:26', '2022-05-28 02:00:26', 5, 1, 'تمت إضافة مزاد جديد', '14', '1', 'hyundai_accent_1.webp', '3651.00', '2022-11-07'),
(32, '2022-05-28 02:00:26', '2022-05-28 02:17:21', 6, 0, 'تمت إضافة مزاد جديد', '14', '1', 'hyundai_accent_1.webp', '3651.00', '2022-11-07'),
(33, '2022-05-28 02:00:27', '2022-05-28 02:00:27', 7, 1, 'تمت إضافة مزاد جديد', '14', '1', 'hyundai_accent_1.webp', '3651.00', '2022-11-07'),
(34, '2022-05-28 02:00:27', '2022-05-28 02:00:27', 8, 1, 'تمت إضافة مزاد جديد', '14', '1', 'hyundai_accent_1.webp', '3651.00', '2022-11-07'),
(35, '2022-05-28 02:00:27', '2022-05-28 02:00:27', 9, 1, 'لقد تمت الموافقة على مزادك', '14', '2', 'hyundai_accent_1.webp', '3651.00', '2022-11-07'),
(36, '2022-05-28 02:00:27', '2022-05-28 02:00:27', 10, 1, 'تمت إضافة مزاد جديد', '14', '1', 'hyundai_accent_1.webp', '3651.00', '2022-11-07'),
(37, '2022-05-28 02:00:28', '2022-05-28 02:18:49', 2, 0, 'تمت إضافة مزاد جديد', '15', '1', 'hyundai_creta_1.webp', '3029.00', '2022-11-21'),
(38, '2022-05-28 02:00:29', '2022-05-28 02:19:00', 3, 0, 'لقد تمت الموافقة على مزادك', '15', '2', 'hyundai_creta_1.webp', '3029.00', '2022-11-21'),
(39, '2022-05-28 02:00:29', '2022-05-28 02:00:29', 4, 1, 'تمت إضافة مزاد جديد', '15', '1', 'hyundai_creta_1.webp', '3029.00', '2022-11-21'),
(40, '2022-05-28 02:00:29', '2022-05-28 02:00:29', 5, 1, 'تمت إضافة مزاد جديد', '15', '1', 'hyundai_creta_1.webp', '3029.00', '2022-11-21'),
(41, '2022-05-28 02:00:29', '2022-05-28 02:17:21', 6, 0, 'تمت إضافة مزاد جديد', '15', '1', 'hyundai_creta_1.webp', '3029.00', '2022-11-21'),
(42, '2022-05-28 02:00:30', '2022-05-28 02:00:30', 7, 1, 'تمت إضافة مزاد جديد', '15', '1', 'hyundai_creta_1.webp', '3029.00', '2022-11-21'),
(43, '2022-05-28 02:00:30', '2022-05-28 02:00:30', 8, 1, 'تمت إضافة مزاد جديد', '15', '1', 'hyundai_creta_1.webp', '3029.00', '2022-11-21'),
(44, '2022-05-28 02:00:30', '2022-05-28 02:00:30', 9, 1, 'تمت إضافة مزاد جديد', '15', '1', 'hyundai_creta_1.webp', '3029.00', '2022-11-21'),
(45, '2022-05-28 02:00:30', '2022-05-28 02:00:30', 10, 1, 'تمت إضافة مزاد جديد', '15', '1', 'hyundai_creta_1.webp', '3029.00', '2022-11-21'),
(46, '2022-05-28 02:00:31', '2022-05-28 02:18:49', 2, 0, 'تمت إضافة مزاد جديد', '13', '1', 'toyota_land_cruiser_4.webp', '1439.00', '2022-10-24'),
(47, '2022-05-28 02:00:32', '2022-05-28 02:19:00', 3, 0, 'تمت إضافة مزاد جديد', '13', '1', 'toyota_land_cruiser_4.webp', '1439.00', '2022-10-24'),
(48, '2022-05-28 02:00:32', '2022-05-28 02:00:32', 4, 1, 'تمت إضافة مزاد جديد', '13', '1', 'toyota_land_cruiser_4.webp', '1439.00', '2022-10-24'),
(49, '2022-05-28 02:00:32', '2022-05-28 02:00:32', 5, 1, 'تمت إضافة مزاد جديد', '13', '1', 'toyota_land_cruiser_4.webp', '1439.00', '2022-10-24'),
(50, '2022-05-28 02:00:32', '2022-05-28 02:17:21', 6, 0, 'لقد تمت الموافقة على مزادك', '13', '2', 'toyota_land_cruiser_4.webp', '1439.00', '2022-10-24'),
(51, '2022-05-28 02:00:33', '2022-05-28 02:00:33', 7, 1, 'تمت إضافة مزاد جديد', '13', '1', 'toyota_land_cruiser_4.webp', '1439.00', '2022-10-24'),
(52, '2022-05-28 02:00:33', '2022-05-28 02:00:33', 8, 1, 'تمت إضافة مزاد جديد', '13', '1', 'toyota_land_cruiser_4.webp', '1439.00', '2022-10-24'),
(53, '2022-05-28 02:00:33', '2022-05-28 02:00:33', 9, 1, 'تمت إضافة مزاد جديد', '13', '1', 'toyota_land_cruiser_4.webp', '1439.00', '2022-10-24'),
(54, '2022-05-28 02:00:33', '2022-05-28 02:00:33', 10, 1, 'تمت إضافة مزاد جديد', '13', '1', 'toyota_land_cruiser_4.webp', '1439.00', '2022-10-24'),
(55, '2022-05-28 02:00:34', '2022-05-28 02:18:49', 2, 0, 'تمت إضافة مزاد جديد', '12', '1', 'fan3.jpg', '3090.00', '2022-10-10'),
(56, '2022-05-28 02:00:35', '2022-05-28 02:19:00', 3, 0, 'تمت إضافة مزاد جديد', '12', '1', 'fan3.jpg', '3090.00', '2022-10-10'),
(57, '2022-05-28 02:00:35', '2022-05-28 02:00:35', 4, 1, 'تمت إضافة مزاد جديد', '12', '1', 'fan3.jpg', '3090.00', '2022-10-10'),
(58, '2022-05-28 02:00:35', '2022-05-28 02:00:35', 5, 1, 'لقد تمت الموافقة على مزادك', '12', '2', 'fan3.jpg', '3090.00', '2022-10-10'),
(59, '2022-05-28 02:00:35', '2022-05-28 02:17:21', 6, 0, 'تمت إضافة مزاد جديد', '12', '1', 'fan3.jpg', '3090.00', '2022-10-10'),
(60, '2022-05-28 02:00:36', '2022-05-28 02:00:36', 7, 1, 'تمت إضافة مزاد جديد', '12', '1', 'fan3.jpg', '3090.00', '2022-10-10'),
(61, '2022-05-28 02:00:36', '2022-05-28 02:00:36', 8, 1, 'تمت إضافة مزاد جديد', '12', '1', 'fan3.jpg', '3090.00', '2022-10-10'),
(62, '2022-05-28 02:00:36', '2022-05-28 02:00:36', 9, 1, 'تمت إضافة مزاد جديد', '12', '1', 'fan3.jpg', '3090.00', '2022-10-10'),
(63, '2022-05-28 02:00:36', '2022-05-28 02:00:36', 10, 1, 'تمت إضافة مزاد جديد', '12', '1', 'fan3.jpg', '3090.00', '2022-10-10'),
(64, '2022-05-28 02:00:37', '2022-05-28 02:18:49', 2, 0, 'تمت إضافة مزاد جديد', '11', '1', 'fan4.jpg', '1128.00', '2022-10-03'),
(65, '2022-05-28 02:00:38', '2022-05-28 02:19:00', 3, 0, 'تمت إضافة مزاد جديد', '11', '1', 'fan4.jpg', '1128.00', '2022-10-03'),
(66, '2022-05-28 02:00:38', '2022-05-28 02:00:38', 4, 1, 'تمت إضافة مزاد جديد', '11', '1', 'fan4.jpg', '1128.00', '2022-10-03'),
(67, '2022-05-28 02:00:38', '2022-05-28 02:00:38', 5, 1, 'تمت إضافة مزاد جديد', '11', '1', 'fan4.jpg', '1128.00', '2022-10-03'),
(68, '2022-05-28 02:00:38', '2022-05-28 02:17:21', 6, 0, 'لقد تمت الموافقة على مزادك', '11', '2', 'fan4.jpg', '1128.00', '2022-10-03'),
(69, '2022-05-28 02:00:39', '2022-05-28 02:00:39', 7, 1, 'تمت إضافة مزاد جديد', '11', '1', 'fan4.jpg', '1128.00', '2022-10-03'),
(70, '2022-05-28 02:00:39', '2022-05-28 02:00:39', 8, 1, 'تمت إضافة مزاد جديد', '11', '1', 'fan4.jpg', '1128.00', '2022-10-03'),
(71, '2022-05-28 02:00:39', '2022-05-28 02:00:39', 9, 1, 'تمت إضافة مزاد جديد', '11', '1', 'fan4.jpg', '1128.00', '2022-10-03'),
(72, '2022-05-28 02:00:39', '2022-05-28 02:00:39', 10, 1, 'تمت إضافة مزاد جديد', '11', '1', 'fan4.jpg', '1128.00', '2022-10-03'),
(73, '2022-05-28 02:00:40', '2022-05-28 02:18:49', 2, 0, 'تمت إضافة مزاد جديد', '10', '1', 'fan2.jpg', '1064.00', '2022-09-19'),
(74, '2022-05-28 02:00:41', '2022-05-28 02:19:01', 3, 0, 'تمت إضافة مزاد جديد', '10', '1', 'fan2.jpg', '1064.00', '2022-09-19'),
(75, '2022-05-28 02:00:41', '2022-05-28 02:00:41', 4, 1, 'تمت إضافة مزاد جديد', '10', '1', 'fan2.jpg', '1064.00', '2022-09-19'),
(76, '2022-05-28 02:00:41', '2022-05-28 02:00:41', 5, 1, 'تمت إضافة مزاد جديد', '10', '1', 'fan2.jpg', '1064.00', '2022-09-19'),
(77, '2022-05-28 02:00:41', '2022-05-28 02:17:21', 6, 0, 'تمت إضافة مزاد جديد', '10', '1', 'fan2.jpg', '1064.00', '2022-09-19'),
(78, '2022-05-28 02:00:42', '2022-05-28 02:00:42', 7, 1, 'تمت إضافة مزاد جديد', '10', '1', 'fan2.jpg', '1064.00', '2022-09-19'),
(79, '2022-05-28 02:00:42', '2022-05-28 02:00:42', 8, 1, 'تمت إضافة مزاد جديد', '10', '1', 'fan2.jpg', '1064.00', '2022-09-19'),
(80, '2022-05-28 02:00:42', '2022-05-28 02:00:42', 9, 1, 'تمت إضافة مزاد جديد', '10', '1', 'fan2.jpg', '1064.00', '2022-09-19'),
(81, '2022-05-28 02:00:42', '2022-05-28 02:00:42', 10, 1, 'لقد تمت الموافقة على مزادك', '10', '2', 'fan2.jpg', '1064.00', '2022-09-19'),
(82, '2022-05-28 02:00:43', '2022-05-28 02:18:49', 2, 0, 'تمت إضافة مزاد جديد', '9', '1', 'fan1.jpg', '2282.00', '2022-09-12'),
(83, '2022-05-28 02:00:44', '2022-05-28 02:19:01', 3, 0, 'تمت إضافة مزاد جديد', '9', '1', 'fan1.jpg', '2282.00', '2022-09-12'),
(84, '2022-05-28 02:00:44', '2022-05-28 02:00:44', 4, 1, 'تمت إضافة مزاد جديد', '9', '1', 'fan1.jpg', '2282.00', '2022-09-12'),
(85, '2022-05-28 02:00:44', '2022-05-28 02:00:44', 5, 1, 'تمت إضافة مزاد جديد', '9', '1', 'fan1.jpg', '2282.00', '2022-09-12'),
(86, '2022-05-28 02:00:44', '2022-05-28 02:17:21', 6, 0, 'لقد تمت الموافقة على مزادك', '9', '2', 'fan1.jpg', '2282.00', '2022-09-12'),
(87, '2022-05-28 02:00:45', '2022-05-28 02:00:45', 7, 1, 'تمت إضافة مزاد جديد', '9', '1', 'fan1.jpg', '2282.00', '2022-09-12'),
(88, '2022-05-28 02:00:45', '2022-05-28 02:00:45', 8, 1, 'تمت إضافة مزاد جديد', '9', '1', 'fan1.jpg', '2282.00', '2022-09-12'),
(89, '2022-05-28 02:00:45', '2022-05-28 02:00:45', 9, 1, 'تمت إضافة مزاد جديد', '9', '1', 'fan1.jpg', '2282.00', '2022-09-12'),
(90, '2022-05-28 02:00:45', '2022-05-28 02:00:45', 10, 1, 'تمت إضافة مزاد جديد', '9', '1', 'fan1.jpg', '2282.00', '2022-09-12'),
(91, '2022-05-28 02:00:46', '2022-05-28 02:18:49', 2, 0, 'تمت إضافة مزاد جديد', '8', '1', 'bus4.jpg', '825.00', '2022-08-29'),
(92, '2022-05-28 02:00:47', '2022-05-28 02:19:01', 3, 0, 'تمت إضافة مزاد جديد', '8', '1', 'bus4.jpg', '825.00', '2022-08-29'),
(93, '2022-05-28 02:00:47', '2022-05-28 02:00:47', 4, 1, 'تمت إضافة مزاد جديد', '8', '1', 'bus4.jpg', '825.00', '2022-08-29'),
(94, '2022-05-28 02:00:47', '2022-05-28 02:00:47', 5, 1, 'تمت إضافة مزاد جديد', '8', '1', 'bus4.jpg', '825.00', '2022-08-29'),
(95, '2022-05-28 02:00:47', '2022-05-28 02:17:21', 6, 0, 'تمت إضافة مزاد جديد', '8', '1', 'bus4.jpg', '825.00', '2022-08-29'),
(96, '2022-05-28 02:00:48', '2022-05-28 02:00:48', 7, 1, 'تمت إضافة مزاد جديد', '8', '1', 'bus4.jpg', '825.00', '2022-08-29'),
(97, '2022-05-28 02:00:48', '2022-05-28 02:00:48', 8, 1, 'تمت إضافة مزاد جديد', '8', '1', 'bus4.jpg', '825.00', '2022-08-29'),
(98, '2022-05-28 02:00:48', '2022-05-28 02:00:48', 9, 1, 'لقد تمت الموافقة على مزادك', '8', '2', 'bus4.jpg', '825.00', '2022-08-29'),
(99, '2022-05-28 02:00:48', '2022-05-28 02:00:48', 10, 1, 'تمت إضافة مزاد جديد', '8', '1', 'bus4.jpg', '825.00', '2022-08-29'),
(100, '2022-05-28 02:00:49', '2022-05-28 02:18:49', 2, 0, 'تمت إضافة مزاد جديد', '7', '1', 'bus3.png', '1299.00', '2022-08-15'),
(101, '2022-05-28 02:00:50', '2022-05-28 02:19:01', 3, 0, 'تمت إضافة مزاد جديد', '7', '1', 'bus3.png', '1299.00', '2022-08-15'),
(102, '2022-05-28 02:00:50', '2022-05-28 02:00:50', 4, 1, 'تمت إضافة مزاد جديد', '7', '1', 'bus3.png', '1299.00', '2022-08-15'),
(103, '2022-05-28 02:00:50', '2022-05-28 02:00:50', 5, 1, 'تمت إضافة مزاد جديد', '7', '1', 'bus3.png', '1299.00', '2022-08-15'),
(104, '2022-05-28 02:00:50', '2022-05-28 02:17:21', 6, 0, 'لقد تمت الموافقة على مزادك', '7', '2', 'bus3.png', '1299.00', '2022-08-15'),
(105, '2022-05-28 02:00:51', '2022-05-28 02:00:51', 7, 1, 'تمت إضافة مزاد جديد', '7', '1', 'bus3.png', '1299.00', '2022-08-15'),
(106, '2022-05-28 02:00:51', '2022-05-28 02:00:51', 8, 1, 'تمت إضافة مزاد جديد', '7', '1', 'bus3.png', '1299.00', '2022-08-15'),
(107, '2022-05-28 02:00:51', '2022-05-28 02:00:51', 9, 1, 'تمت إضافة مزاد جديد', '7', '1', 'bus3.png', '1299.00', '2022-08-15'),
(108, '2022-05-28 02:00:51', '2022-05-28 02:00:51', 10, 1, 'تمت إضافة مزاد جديد', '7', '1', 'bus3.png', '1299.00', '2022-08-15'),
(109, '2022-05-28 02:00:52', '2022-05-28 02:18:49', 2, 0, 'تمت إضافة مزاد جديد', '6', '1', 'bus2.png', '3636.00', '2022-08-08'),
(110, '2022-05-28 02:00:53', '2022-05-28 02:19:01', 3, 0, 'تمت إضافة مزاد جديد', '6', '1', 'bus2.png', '3636.00', '2022-08-08'),
(111, '2022-05-28 02:00:53', '2022-05-28 02:00:53', 4, 1, 'تمت إضافة مزاد جديد', '6', '1', 'bus2.png', '3636.00', '2022-08-08'),
(112, '2022-05-28 02:00:53', '2022-05-28 02:00:53', 5, 1, 'تمت إضافة مزاد جديد', '6', '1', 'bus2.png', '3636.00', '2022-08-08'),
(113, '2022-05-28 02:00:53', '2022-05-28 02:17:21', 6, 0, 'لقد تمت الموافقة على مزادك', '6', '2', 'bus2.png', '3636.00', '2022-08-08'),
(114, '2022-05-28 02:00:54', '2022-05-28 02:00:54', 7, 1, 'تمت إضافة مزاد جديد', '6', '1', 'bus2.png', '3636.00', '2022-08-08'),
(115, '2022-05-28 02:00:54', '2022-05-28 02:00:54', 8, 1, 'تمت إضافة مزاد جديد', '6', '1', 'bus2.png', '3636.00', '2022-08-08'),
(116, '2022-05-28 02:00:54', '2022-05-28 02:00:54', 9, 1, 'تمت إضافة مزاد جديد', '6', '1', 'bus2.png', '3636.00', '2022-08-08'),
(117, '2022-05-28 02:00:54', '2022-05-28 02:00:54', 10, 1, 'تمت إضافة مزاد جديد', '6', '1', 'bus2.png', '3636.00', '2022-08-08'),
(118, '2022-05-28 02:00:55', '2022-05-28 02:18:49', 2, 0, 'تمت إضافة مزاد جديد', '5', '1', 'bus12.png', '1427.00', '2022-07-25'),
(119, '2022-05-28 02:00:56', '2022-05-28 02:19:01', 3, 0, 'تمت إضافة مزاد جديد', '5', '1', 'bus12.png', '1427.00', '2022-07-25'),
(120, '2022-05-28 02:00:56', '2022-05-28 02:00:56', 4, 1, 'لقد تمت الموافقة على مزادك', '5', '2', 'bus12.png', '1427.00', '2022-07-25'),
(121, '2022-05-28 02:00:56', '2022-05-28 02:00:56', 5, 1, 'تمت إضافة مزاد جديد', '5', '1', 'bus12.png', '1427.00', '2022-07-25'),
(122, '2022-05-28 02:00:56', '2022-05-28 02:17:21', 6, 0, 'تمت إضافة مزاد جديد', '5', '1', 'bus12.png', '1427.00', '2022-07-25'),
(123, '2022-05-28 02:00:57', '2022-05-28 02:00:57', 7, 1, 'تمت إضافة مزاد جديد', '5', '1', 'bus12.png', '1427.00', '2022-07-25'),
(124, '2022-05-28 02:00:57', '2022-05-28 02:00:57', 8, 1, 'تمت إضافة مزاد جديد', '5', '1', 'bus12.png', '1427.00', '2022-07-25'),
(125, '2022-05-28 02:00:57', '2022-05-28 02:00:57', 9, 1, 'تمت إضافة مزاد جديد', '5', '1', 'bus12.png', '1427.00', '2022-07-25'),
(126, '2022-05-28 02:00:57', '2022-05-28 02:00:57', 10, 1, 'تمت إضافة مزاد جديد', '5', '1', 'bus12.png', '1427.00', '2022-07-25'),
(127, '2022-05-28 02:00:58', '2022-05-28 02:18:49', 2, 0, 'لقد تمت الموافقة على مزادك', '4', '2', 'car4.PNG', '909.00', '2022-07-11'),
(128, '2022-05-28 02:00:59', '2022-05-28 02:19:01', 3, 0, 'تمت إضافة مزاد جديد', '4', '1', 'car4.PNG', '909.00', '2022-07-11'),
(129, '2022-05-28 02:00:59', '2022-05-28 02:00:59', 4, 1, 'تمت إضافة مزاد جديد', '4', '1', 'car4.PNG', '909.00', '2022-07-11'),
(130, '2022-05-28 02:00:59', '2022-05-28 02:00:59', 5, 1, 'تمت إضافة مزاد جديد', '4', '1', 'car4.PNG', '909.00', '2022-07-11'),
(131, '2022-05-28 02:00:59', '2022-05-28 02:17:21', 6, 0, 'تمت إضافة مزاد جديد', '4', '1', 'car4.PNG', '909.00', '2022-07-11'),
(132, '2022-05-28 02:01:00', '2022-05-28 02:01:00', 7, 1, 'تمت إضافة مزاد جديد', '4', '1', 'car4.PNG', '909.00', '2022-07-11'),
(133, '2022-05-28 02:01:00', '2022-05-28 02:01:00', 8, 1, 'تمت إضافة مزاد جديد', '4', '1', 'car4.PNG', '909.00', '2022-07-11'),
(134, '2022-05-28 02:01:00', '2022-05-28 02:01:00', 9, 1, 'تمت إضافة مزاد جديد', '4', '1', 'car4.PNG', '909.00', '2022-07-11'),
(135, '2022-05-28 02:01:00', '2022-05-28 02:01:00', 10, 1, 'تمت إضافة مزاد جديد', '4', '1', 'car4.PNG', '909.00', '2022-07-11'),
(136, '2022-05-28 02:01:01', '2022-05-28 02:18:49', 2, 0, 'تمت إضافة مزاد جديد', '3', '1', 'car3.PNG', '3108.00', '2022-07-04'),
(137, '2022-05-28 02:01:02', '2022-05-28 02:19:01', 3, 0, 'تمت إضافة مزاد جديد', '3', '1', 'car3.PNG', '3108.00', '2022-07-04'),
(138, '2022-05-28 02:01:02', '2022-05-28 02:01:02', 4, 1, 'تمت إضافة مزاد جديد', '3', '1', 'car3.PNG', '3108.00', '2022-07-04'),
(139, '2022-05-28 02:01:02', '2022-05-28 02:01:02', 5, 1, 'تمت إضافة مزاد جديد', '3', '1', 'car3.PNG', '3108.00', '2022-07-04'),
(140, '2022-05-28 02:01:02', '2022-05-28 02:17:21', 6, 0, 'تمت إضافة مزاد جديد', '3', '1', 'car3.PNG', '3108.00', '2022-07-04'),
(141, '2022-05-28 02:01:03', '2022-05-28 02:01:03', 7, 1, 'تمت إضافة مزاد جديد', '3', '1', 'car3.PNG', '3108.00', '2022-07-04'),
(142, '2022-05-28 02:01:03', '2022-05-28 02:01:03', 8, 1, 'لقد تمت الموافقة على مزادك', '3', '2', 'car3.PNG', '3108.00', '2022-07-04'),
(143, '2022-05-28 02:01:03', '2022-05-28 02:01:03', 9, 1, 'تمت إضافة مزاد جديد', '3', '1', 'car3.PNG', '3108.00', '2022-07-04'),
(144, '2022-05-28 02:01:03', '2022-05-28 02:01:03', 10, 1, 'تمت إضافة مزاد جديد', '3', '1', 'car3.PNG', '3108.00', '2022-07-04'),
(145, '2022-05-28 02:01:04', '2022-05-28 02:18:49', 2, 0, 'تمت إضافة مزاد جديد', '1', '1', 'car1.PNG', '980.00', '2022-06-13'),
(146, '2022-05-28 02:01:05', '2022-05-28 02:19:01', 3, 0, 'تمت إضافة مزاد جديد', '1', '1', 'car1.PNG', '980.00', '2022-06-13'),
(147, '2022-05-28 02:01:05', '2022-05-28 02:01:05', 4, 1, 'تمت إضافة مزاد جديد', '1', '1', 'car1.PNG', '980.00', '2022-06-13'),
(148, '2022-05-28 02:01:05', '2022-05-28 02:01:05', 5, 1, 'لقد تمت الموافقة على مزادك', '1', '2', 'car1.PNG', '980.00', '2022-06-13'),
(149, '2022-05-28 02:01:05', '2022-05-28 02:17:21', 6, 0, 'تمت إضافة مزاد جديد', '1', '1', 'car1.PNG', '980.00', '2022-06-13'),
(150, '2022-05-28 02:01:05', '2022-05-28 02:01:05', 7, 1, 'تمت إضافة مزاد جديد', '1', '1', 'car1.PNG', '980.00', '2022-06-13'),
(151, '2022-05-28 02:01:06', '2022-05-28 02:01:06', 8, 1, 'تمت إضافة مزاد جديد', '1', '1', 'car1.PNG', '980.00', '2022-06-13'),
(152, '2022-05-28 02:01:06', '2022-05-28 02:01:06', 9, 1, 'تمت إضافة مزاد جديد', '1', '1', 'car1.PNG', '980.00', '2022-06-13'),
(153, '2022-05-28 02:01:06', '2022-05-28 02:01:06', 10, 1, 'تمت إضافة مزاد جديد', '1', '1', 'car1.PNG', '980.00', '2022-06-13'),
(154, '2022-05-28 03:01:39', '2022-05-28 03:01:39', 8, 1, 'لقد تمت المزايدة على سيارتك', '3', '4', 'car3.PNG', '3108.00', '2022-07-04'),
(155, '2022-05-28 03:02:59', '2022-05-28 03:02:59', 4, 1, 'لقد فزت بمزاد سيارة 🥳', '3', '5', 'car3.PNG', '3108.00', '2022-07-04'),
(156, '2022-05-28 03:12:57', '2022-05-28 03:12:57', 8, 1, 'لقد تمت المزايدة على سيارتك', '8', '4', 'bus4.jpg', '5000.00', '2022-08-29'),
(157, '2022-05-28 03:13:40', '2022-05-28 03:13:40', 4, 1, 'لقد فزت بمزاد سيارة 🥳', '8', '5', 'bus4.jpg', '5000.00', '2022-08-29');

-- --------------------------------------------------------

--
-- بنية الجدول `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- بنية الجدول `payment_bills`
--

CREATE TABLE `payment_bills` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `invoice_reference` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `payment_status` tinyint(1) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `bid_id` bigint(20) UNSIGNED DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `payment_bills`
--

INSERT INTO `payment_bills` (`id`, `invoice_reference`, `payment_status`, `created_at`, `bid_id`) VALUES
(1, 'eXqp3xlTI1', 1, '2022-05-28 03:04:31', 1),
(2, 'qHwSRrzBCd', 1, '2022-05-28 03:14:38', 2);

-- --------------------------------------------------------

--
-- بنية الجدول `permissions`
--

CREATE TABLE `permissions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `display_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `description` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- بنية الجدول `permission_role`
--

CREATE TABLE `permission_role` (
  `permission_id` bigint(20) UNSIGNED NOT NULL,
  `role_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- بنية الجدول `permission_user`
--

CREATE TABLE `permission_user` (
  `permission_id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `user_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- بنية الجدول `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `abilities` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- بنية الجدول `profiles`
--

CREATE TABLE `profiles` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `username` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `bio` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `avatar` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `phone` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `job` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `city` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `address` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `profiles`
--

INSERT INTO `profiles` (`id`, `username`, `bio`, `avatar`, `phone`, `job`, `city`, `address`, `created_at`, `updated_at`, `user_id`) VALUES
(1, 'جهاد المليكي', 'A rerum optio amet quis occaecati quis et.', 'jihad.jpg', '737-780-703', 'Software Engineering', 'Taiz', 'الروضه ،جوار جامع التقوى ،فوق مدرسه المعالي', '1978-04-15 21:00:00', '2006-01-01 21:00:00', 2),
(2, 'Abrar', 'مهتمة بتصميم وبرمجة مواقع الويب', 'abrar.jpg', '736-565-237', 'IT Engineering', 'Taiz City', 'المسبح الأعلى، جوار مدرسة النبراس الأهلية', '2007-07-01 21:00:00', '1971-11-07 21:00:00', 3),
(3, 'Reem', 'مهتمة بتصميم وبرمجة مواقع الويب', 'reem.jpg', '775-301-706', NULL, 'Taiz City', 'شارع جمال ،    ', '1993-08-17 21:00:00', '2010-03-14 21:00:00', 4),
(4, 'علي الرعيني', 'مهتم بتصميم وبرمجة مواقع الويب', 'ali.jpg', '773-739-473', ' UXUI Designer', 'مدينة تعز ', ' القاهرة ،    ', '2007-07-01 21:00:00', '1978-10-10 21:00:00', 5),
(5, 'Hamad', 'مهتم بتصميم وبرمجة مواقع الويب', 'hamad.jpg', '714722084', 'Web Developer', 'Taiz City', 'شارع التحرير، جوار فندق الشريف', '1977-12-29 21:00:00', '2014-09-20 21:00:00', 6),
(6, 'اراده الفقي', 'مهتمه بتصميم وبرمجة مواقع الويب', 'erada.jpg', '059-338-702', 'Supervisor', 'Sanaa', 'صنعاء، شارع حده', '2013-07-28 21:00:00', '1979-09-04 21:00:00', 7),
(7, 'نشوان', 'مهتم بتصميم وبرمجة مواقع الويب', 'nashwan.jpg', '455-235-961', 'Projet Manager', 'Sanaa', 'صنعاء، شارع حده', '1985-08-17 21:00:00', '2004-04-26 21:00:00', 8),
(8, 'مختار غالب', 'مهتم بتصميم وبرمجة مواقع الويب', 'mokhtar.png', '058-607-024', 'Product Manager', 'Sanaa', 'صنعاء، شارع حده', '1970-11-04 21:00:00', '2001-07-07 21:00:00', 9),
(9, 'هيثم المقطري', 'مهتم بتصميم وبرمجة مواقع الويب', 'haitham.png', '723-597-559', 'Super Sponsor', 'Sanaa', 'صنعاء، شارع حده', '1990-08-20 21:00:00', '1970-09-17 21:00:00', 10);

-- --------------------------------------------------------

--
-- بنية الجدول `questions`
--

CREATE TABLE `questions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `question` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `answer` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `questions`
--

INSERT INTO `questions` (`id`, `created_at`, `updated_at`, `question`, `answer`, `is_active`) VALUES
(1, NULL, NULL, 'كيف طريقة شراء سيارة؟', 'كيف طريقة شراء ستتم في البداية عملية شراء السيارة من خلال دفع عربون بقيمة 500 ريال, هذا العربون مخصوم من سعر السيارة الاجمالي و مسترد في حال عدم اتمام عملية الشراء شرط عدم تثبيت حجز السيارة.', 1),
(2, NULL, NULL, 'كيف أدفع قيمة السيارة؟', 'كيف طريقة شراء ستتم في البداية عملية شراء السيارة من خلال دفع عربون بقيمة 500 ريال, هذا العربونيمكنك دفع باقي قيمة السيارة وذلك بعد تأكيد حجز السيارة مع موظف المبيعات المختص، ويكون ذلك بواسطة خدمة سداد السعودية وهي الأسهل والأسرع أو حوالة مصرفية لحساب الشركة لدى بنك الرياض. سيساعدك موظفينا في اجراء الدفع بكل يسر ان شاء الله', 1),
(3, NULL, NULL, 'هل موقعكم معتمد من قبل وزارة التجارة؟', 'نعم! هذا الموقع موثق من وزارة التجارة والاستثمار وبدعم من شركة علم, بسجل تجاري رقم 1010538980.', 1),
(4, NULL, NULL, 'ما هي خطوات شراء سيارة منكم؟', 'خطوات شراء سيارة 1. حجز السيارة تحجز السيارة التي تريدها بعربون بقيمة 500 ريال مسترد قبل تأكيد حجز السيارة،\r\n            وخلال 24 ساعة من دفع العربون سيتواصل معك أحد موظفي قسم المبيعات المختص من شركة سيارة لتأكيد\r\n            طلبك والتأكد انها متوفرة لدينا. 2. دفع باقي قيمة السيارة بعد التأكد من وجود السيارة مع موظف المبيعات\r\n            المختص واعتماد السيارة من جهتك، يمكنك الآن القيام بتحويل باقي قيمة السيارة بواسطة خدمة سداد السعودية\r\n            وهي الأسهل والأسرع أوالى حساب شركة سيارة لدى بنك الرياض. 3. تأمين السيارة بعد دفع قيمة السيارة يتم\r\n            التأمين على سيارتك من خلال موظف المبيعات مباشرة، أو تزويدك بنسخة عن البطاقة الجمركية لتقوم بالتأمين على\r\n            سيارتك ومن ثم تزويدنا بنسخة عن التأمين للانتقال بعد ذلك الى مرحلة تسجيل السيارة وإصدار الإستمارة. 4. تسجيل\r\n            السيارة بعد دفع باقي قيمة السيارة وتأمينها نقوم باجراءات التسجيل لدى المرور لإصدار الاستمارة. 5. شحن سيارتك\r\n            بعد التأكد من جاهزية سيارتك نقوم بإجراءات الشحن مباشرة الى مدينتك أو أقرب مدينة اليك أو الى باب منزلك مع\r\n            رسوم شحن اضافية', 1),
(5, NULL, NULL, 'ما هي الوثائق المطلوبة لشراء سيارة منكم؟', '1. صورة عن رخصة القيادة سارية المفعول. 2. صورة عن الهوية الشحصية.', 1),
(6, NULL, NULL, 'هل موقعكم معتمد من قبل وزارة التجارة؟', 'نعم! هذا الموقع موثق من وزارة التجارة والاستثمار وبدعم من شركة علم, بسجل تجاري رقم 1010538980.', 1),
(7, NULL, NULL, 'إجراءات التسجيل', 'بعد تحويل المبلغ لحساب الشركه يقوم الموظف المختص باجراءات التسجيل لدى المرور.', 1),
(8, NULL, NULL, ' كيف أقوم بإستلام السيارة؟', 'يتم استلام السيارة من خلال شركة سعيد البسامي للشحن بأقرب فرع لهم موجود في مدينتك, و سيتم تزويدك\r\n            ببوليصة الشحن بالتاريخ المتوقع لاستلام السيارة.', 1);

-- --------------------------------------------------------

--
-- بنية الجدول `review_ratings`
--

CREATE TABLE `review_ratings` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `comments` longtext COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `star_rating` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `review_ratings`
--

INSERT INTO `review_ratings` (`id`, `created_at`, `updated_at`, `user_id`, `name`, `comments`, `star_rating`) VALUES
(1, '2022-05-28 01:58:43', '2022-05-28 01:58:43', 2, 'أبرار الخراساني', 'شخص ثقة', 1),
(2, '2022-05-28 01:58:43', '2022-05-28 01:58:43', 3, 'جهاد المليكي', 'ممتاز ،انصح بالتعامل مع هذا البائع', 4),
(3, '2022-05-28 01:58:43', '2022-05-28 01:58:43', 4, 'علي الرعيني', 'شخص ثقة لكنه يتأخر قليلا في تسليم المتفق عليه', 3),
(4, '2022-05-28 01:58:43', '2022-05-28 01:58:43', 5, 'حمد البكيل', 'التعامل معه جيد لا بأس به', 1),
(5, '2022-05-28 01:58:43', '2022-05-28 01:58:43', 5, 'هيثم المقطري', 'موقع بابور موقع امن دائما يوفر افضل مقدمي العروض', 5),
(6, '2022-05-28 01:58:43', '2022-05-28 01:58:43', 6, 'اراده الفقي', 'هذا الشخص ثقة، سأكرر معه المعاملة مرة أخرى', 3),
(7, '2022-05-28 01:58:43', '2022-05-28 01:58:43', 7, 'مختار غالب', 'دائما يقدم اضخم العروض للسيارات بالشرق الاوسط', 5),
(8, '2022-05-28 01:58:43', '2022-05-28 01:58:43', 8, 'أبرار الخراساني', 'أكثر شخص أحب التعامل معه', 4),
(9, '2022-05-28 01:58:43', '2022-05-28 01:58:43', 3, 'هيفاء نبيل', 'عروضه دائما تبهرني، فعلا يستحق التشجيع ', 2),
(10, '2022-05-28 01:58:43', '2022-05-28 01:58:43', 4, 'رقيه عبده', 'التعامل معه لا بأس به، أراه شخص عصبي', 1);

-- --------------------------------------------------------

--
-- بنية الجدول `roles`
--

CREATE TABLE `roles` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `display_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `description` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `roles`
--

INSERT INTO `roles` (`id`, `name`, `display_name`, `description`, `created_at`, `updated_at`) VALUES
(1, 'super_admin', 'الادمن الاعلى', NULL, '2022-05-28 01:58:41', '2022-05-28 01:58:41'),
(2, 'admin', 'الأدمن', NULL, '2022-05-28 01:58:41', '2022-05-28 01:58:41'),
(3, 'user', 'مستخدم', NULL, '2022-05-28 01:58:41', '2022-05-28 01:58:41');

-- --------------------------------------------------------

--
-- بنية الجدول `role_user`
--

CREATE TABLE `role_user` (
  `role_id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `user_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `role_user`
--

INSERT INTO `role_user` (`role_id`, `user_id`, `user_type`) VALUES
(1, 1, 'App\\Models\\User'),
(3, 2, 'App\\Models\\User'),
(3, 3, 'App\\Models\\User'),
(3, 4, 'App\\Models\\User'),
(3, 5, 'App\\Models\\User'),
(3, 6, 'App\\Models\\User'),
(3, 7, 'App\\Models\\User'),
(3, 8, 'App\\Models\\User'),
(3, 9, 'App\\Models\\User'),
(3, 10, 'App\\Models\\User');

-- --------------------------------------------------------

--
-- بنية الجدول `series`
--

CREATE TABLE `series` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `brand_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `series`
--

INSERT INTO `series` (`id`, `name`, `is_active`, `created_at`, `updated_at`, `brand_id`) VALUES
(1, 'صني', 1, '1981-04-26 21:00:00', '2013-07-19 21:00:00', 5),
(2, 'تاهو', 1, '2002-02-28 21:00:00', '1989-01-09 21:00:00', 3),
(3, 'تورس', 1, '1972-04-25 21:00:00', '1990-08-29 21:00:00', 4),
(4, 'باترول', 1, '2012-08-07 21:00:00', '1999-07-14 21:00:00', 5),
(5, 'فيتو', 1, '1979-10-25 21:00:00', '2001-05-03 21:00:00', 6),
(6, '        باص سياحي\r\n            ', 1, '2014-07-01 21:00:00', '2007-03-13 21:00:00', 4),
(7, '          اشوك لاند\r\n            ', 1, '2012-09-06 21:00:00', '2007-08-16 21:00:00', 4),
(8, '           اتيكو\r\n            ', 1, '1996-12-20 21:00:00', '2001-10-19 21:00:00', 4),
(9, '           صهريج - تنك\r\n            ', 1, '1987-04-03 21:00:00', '1989-08-20 21:00:00', 4),
(10, '  دينة\r\n            ', 1, '1979-04-01 21:00:00', '2014-04-19 21:00:00', 4);

-- --------------------------------------------------------

--
-- بنية الجدول `services`
--

CREATE TABLE `services` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `pic` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT 'default.png',
  `is_active` tinyint(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `services`
--

INSERT INTO `services` (`id`, `created_at`, `updated_at`, `title`, `description`, `pic`, `is_active`) VALUES
(1, '1996-11-13 21:00:00', '2003-05-06 21:00:00', 'عروض حصرية', 'Et et velit vitae velit ullam sit.', '0', 1),
(2, '2002-03-30 21:00:00', '2008-01-19 21:00:00', 'امان وتشفير ', 'Et quidem neque deserunt et repellendus provident nam est.', '0', 1),
(3, '1986-04-19 21:00:00', '1988-07-30 21:00:00', ' اليه للبيع والشراء ', 'Et nostrum aliquam quaerat incidunt quae est veritatis.', '0', 1),
(4, '1980-05-31 21:00:00', '1998-04-29 21:00:00', '   مزادات متنوعه ', 'Sapiente optio sed blanditiis tenetur nisi occaecati quisquam dolore accusamus velit.', '0', 1),
(5, '1989-10-07 21:00:00', '1978-04-13 21:00:00', 'امكانية عرض سياراتك ', 'Officiis atque minus itaque impedit perspiciatis at reprehenderit sint.', '0', 1),
(6, '1972-02-04 21:00:00', '2002-03-13 21:00:00', '  تجربة مستخدم ممتعه ', 'Qui dicta neque similique sequi blanditiis dolorum asperiores vero.', '0', 1);

-- --------------------------------------------------------

--
-- بنية الجدول `transactions`
--

CREATE TABLE `transactions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `payable_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `payable_id` bigint(20) UNSIGNED NOT NULL,
  `wallet_id` bigint(20) UNSIGNED NOT NULL,
  `type` enum('deposit','withdraw') COLLATE utf8mb4_unicode_ci NOT NULL,
  `amount` decimal(64,0) NOT NULL,
  `confirmed` tinyint(1) NOT NULL,
  `meta` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`meta`)),
  `uuid` char(36) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `transactions`
--

INSERT INTO `transactions` (`id`, `payable_type`, `payable_id`, `wallet_id`, `type`, `amount`, `confirmed`, `meta`, `uuid`, `created_at`, `updated_at`) VALUES
(1, 'App\\Models\\User', 4, 4, 'withdraw', '-15', 1, '{\"bid\":1}', 'c77d274c-51a6-4e8e-903e-6f4b6ade81e0', '2022-05-28 03:01:39', '2022-05-28 03:01:39'),
(2, 'App\\Models\\User', 1, 1, 'deposit', '15', 1, '{\"bid\":1}', '7ab5d6db-6c86-4cd6-b7ef-17041fd6cd75', '2022-05-28 03:01:39', '2022-05-28 03:01:39'),
(3, 'App\\Models\\User', 1, 1, 'withdraw', '-15', 1, '{\"unbid\":1}', 'df2fcb8c-5100-4bb3-991f-24deeeae405b', '2022-05-28 03:03:00', '2022-05-28 03:03:00'),
(4, 'App\\Models\\User', 4, 4, 'deposit', '15', 1, '{\"unbid\":1}', 'cc5d1032-ba32-4ca4-8207-8c05f423e694', '2022-05-28 03:03:00', '2022-05-28 03:03:00'),
(5, 'App\\Models\\User', 4, 4, 'withdraw', '-3258', 1, '{\"buy\":1}', '3a72dfed-6704-4672-a1dc-86453535fc12', '2022-05-28 03:04:31', '2022-05-28 03:04:31'),
(6, 'App\\Models\\User', 1, 1, 'deposit', '3258', 1, '{\"buy\":1}', '74685731-caf1-4520-a1b2-20ea0e86e10c', '2022-05-28 03:04:31', '2022-05-28 03:04:31'),
(7, 'App\\Models\\User', 1, 1, 'withdraw', '-325', 1, '{\"commission\":1}', '186f7ed0-36af-40e1-8710-3f9a5b8b4ea5', '2022-05-28 03:07:20', '2022-05-28 03:07:20'),
(8, 'App\\Models\\User', 1, 1, 'deposit', '325', 1, '{\"commission\":1}', 'fa308ea4-9b47-459b-8c0b-b5cd0d6decda', '2022-05-28 03:07:20', '2022-05-28 03:07:20'),
(9, 'App\\Models\\User', 1, 1, 'withdraw', '-2932', 1, '{\"sell\":1}', '4f795b34-712e-4c17-a21a-825e3c3d27ad', '2022-05-28 03:07:20', '2022-05-28 03:07:20'),
(10, 'App\\Models\\User', 8, 8, 'deposit', '2932', 1, '{\"sell\":1}', 'ef1dd4bb-05a2-487f-82a6-5ee3bda92aa2', '2022-05-28 03:07:20', '2022-05-28 03:07:20'),
(11, 'App\\Models\\User', 4, 4, 'withdraw', '-42', 1, '{\"bid\":2}', '7ac84b00-13ac-4a89-8a28-2922b9013eee', '2022-05-28 03:12:57', '2022-05-28 03:12:57'),
(12, 'App\\Models\\User', 1, 1, 'deposit', '42', 1, '{\"bid\":2}', '7ade5ccc-2148-4fea-9beb-53ce762d41b4', '2022-05-28 03:12:57', '2022-05-28 03:12:57'),
(13, 'App\\Models\\User', 1, 1, 'withdraw', '-42', 1, '{\"unbid\":2}', '049587d6-9b2f-4518-9913-01fb148a82b7', '2022-05-28 03:13:41', '2022-05-28 03:13:41'),
(14, 'App\\Models\\User', 4, 4, 'deposit', '42', 1, '{\"unbid\":2}', '1e02a4d9-e699-4513-87ed-a0e7c1c511f3', '2022-05-28 03:13:41', '2022-05-28 03:13:41'),
(15, 'App\\Models\\User', 4, 4, 'withdraw', '-5420', 1, '{\"buy\":2}', '35eecaf5-be3c-4e4b-886c-99c47b57f628', '2022-05-28 03:14:38', '2022-05-28 03:14:38'),
(16, 'App\\Models\\User', 1, 1, 'deposit', '5420', 1, '{\"buy\":2}', 'a7a23251-ef1a-44a1-98ca-60905f9a8613', '2022-05-28 03:14:38', '2022-05-28 03:14:38'),
(17, 'App\\Models\\User', 1, 1, 'withdraw', '-542', 1, '{\"commission\":2}', '4a3ebfc9-9aaa-400a-be59-505ffa0545fc', '2022-05-28 03:20:21', '2022-05-28 03:20:21'),
(18, 'App\\Models\\User', 1, 1, 'deposit', '542', 1, '{\"commission\":2}', '40ce4e7f-78ee-4391-92ec-1b6b501697d5', '2022-05-28 03:20:21', '2022-05-28 03:20:21'),
(19, 'App\\Models\\User', 1, 1, 'withdraw', '-542', 1, '{\"compensation\":2}', '7c03940f-3cf9-4285-b8bc-fb1b6d1fadee', '2022-05-28 03:20:21', '2022-05-28 03:20:21'),
(20, 'App\\Models\\User', 8, 8, 'deposit', '542', 1, '{\"compensation\":2}', '1faf37ad-1a6c-4fff-80e6-70cedda4839b', '2022-05-28 03:20:21', '2022-05-28 03:20:21'),
(21, 'App\\Models\\User', 1, 1, 'withdraw', '-4336', 1, '{\"unbuy\":2}', '2c72f606-3392-4155-a9d1-877bb6310ffa', '2022-05-28 03:20:21', '2022-05-28 03:20:21'),
(22, 'App\\Models\\User', 4, 4, 'deposit', '4336', 1, '{\"unbuy\":2}', '35ac2f5b-7e22-434f-9d7a-aef3a6968d9b', '2022-05-28 03:20:21', '2022-05-28 03:20:21');

-- --------------------------------------------------------

--
-- بنية الجدول `transfers`
--

CREATE TABLE `transfers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `from_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `from_id` bigint(20) UNSIGNED NOT NULL,
  `to_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `to_id` bigint(20) UNSIGNED NOT NULL,
  `status` enum('exchange','transfer','paid','refund','gift') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'transfer',
  `status_last` enum('exchange','transfer','paid','refund','gift') COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `deposit_id` bigint(20) UNSIGNED NOT NULL,
  `withdraw_id` bigint(20) UNSIGNED NOT NULL,
  `discount` decimal(64,0) NOT NULL DEFAULT 0,
  `fee` decimal(64,0) NOT NULL DEFAULT 0,
  `uuid` char(36) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `transfers`
--

INSERT INTO `transfers` (`id`, `from_type`, `from_id`, `to_type`, `to_id`, `status`, `status_last`, `deposit_id`, `withdraw_id`, `discount`, `fee`, `uuid`, `created_at`, `updated_at`) VALUES
(1, 'Bavix\\Wallet\\Models\\Wallet', 4, 'Bavix\\Wallet\\Models\\Wallet', 1, 'transfer', NULL, 2, 1, '0', '0', '50ae7d4b-4345-43da-87df-6b8bfe029dd4', '2022-05-28 03:01:39', '2022-05-28 03:01:39'),
(2, 'Bavix\\Wallet\\Models\\Wallet', 1, 'Bavix\\Wallet\\Models\\Wallet', 4, 'transfer', NULL, 4, 3, '0', '0', 'd5b34b91-d520-47ba-8ece-be426fd47052', '2022-05-28 03:03:00', '2022-05-28 03:03:00'),
(3, 'Bavix\\Wallet\\Models\\Wallet', 4, 'Bavix\\Wallet\\Models\\Wallet', 1, 'transfer', NULL, 6, 5, '0', '0', '8dfcc351-4a19-45a9-8a13-5ea4ca464a20', '2022-05-28 03:04:31', '2022-05-28 03:04:31'),
(4, 'Bavix\\Wallet\\Models\\Wallet', 1, 'Bavix\\Wallet\\Models\\Wallet', 1, 'transfer', NULL, 8, 7, '0', '0', '35ef9cac-349b-432d-be08-d2af6fc5f51f', '2022-05-28 03:07:20', '2022-05-28 03:07:20'),
(5, 'Bavix\\Wallet\\Models\\Wallet', 1, 'Bavix\\Wallet\\Models\\Wallet', 8, 'transfer', NULL, 10, 9, '0', '0', '808dbad0-62b8-45ac-b52b-490b542a29ea', '2022-05-28 03:07:20', '2022-05-28 03:07:20'),
(6, 'Bavix\\Wallet\\Models\\Wallet', 4, 'Bavix\\Wallet\\Models\\Wallet', 1, 'transfer', NULL, 12, 11, '0', '0', '4e1651ce-04d7-45c8-a085-9cf32043d877', '2022-05-28 03:12:57', '2022-05-28 03:12:57'),
(7, 'Bavix\\Wallet\\Models\\Wallet', 1, 'Bavix\\Wallet\\Models\\Wallet', 4, 'transfer', NULL, 14, 13, '0', '0', '2cd96189-4978-4e58-9921-48868a58deb5', '2022-05-28 03:13:41', '2022-05-28 03:13:41'),
(8, 'Bavix\\Wallet\\Models\\Wallet', 4, 'Bavix\\Wallet\\Models\\Wallet', 1, 'transfer', NULL, 16, 15, '0', '0', 'bc720e6a-f799-4067-bfa7-96935c171edb', '2022-05-28 03:14:38', '2022-05-28 03:14:38'),
(9, 'Bavix\\Wallet\\Models\\Wallet', 1, 'Bavix\\Wallet\\Models\\Wallet', 1, 'transfer', NULL, 18, 17, '0', '0', '56444b5f-d62a-46bb-b801-fb508177648c', '2022-05-28 03:20:21', '2022-05-28 03:20:21'),
(10, 'Bavix\\Wallet\\Models\\Wallet', 1, 'Bavix\\Wallet\\Models\\Wallet', 8, 'transfer', NULL, 20, 19, '0', '0', 'e22c450e-92d4-45ce-b13c-45ce7f9b56f3', '2022-05-28 03:20:21', '2022-05-28 03:20:21'),
(11, 'Bavix\\Wallet\\Models\\Wallet', 1, 'Bavix\\Wallet\\Models\\Wallet', 4, 'transfer', NULL, 22, 21, '0', '0', '822a3e73-1207-46ef-933f-897b30784d5a', '2022-05-28 03:20:21', '2022-05-28 03:20:21');

-- --------------------------------------------------------

--
-- بنية الجدول `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT 1,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `email_verified_at`, `password`, `is_active`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'admin', 'admin@gmail.com', '2022-05-28 01:58:41', '$2y$10$G11oejwjDMCymd4CrPTWIeTEHarlvPEZlD3e67ApKE40b1a7KQZpW', 1, 'zTxn193a41', '2022-05-28 01:58:41', '2022-05-28 01:58:41'),
(2, 'Jehad', 'deeppp901@gmail.com', '2022-05-28 01:58:41', '$2y$10$kL1b3m0dDGaHTKCf4GvWrOU4kaz6GZeWmCYoqDF47FS4HqspRrjR6', 1, '8ZMFRXVIOc13I9gv9W6nsZu54K3sCbzVnjMVX5Ts79UrBmx04kTxCqRH9T6l', '2022-05-28 01:58:41', '2022-05-28 01:58:41'),
(3, 'Abrar', 'abrar.abdulwahed@gmail.com', '2022-05-28 01:58:41', '$2y$10$HyvRv.kQtlAFKzkRzQ78FOGX3p2rKrTtMbc3U.hROKnmvBNlENSHa', 1, 'aMpe0JmwJCJGkEUvLJ4fs26us3ZbaX4MKXCWbXR2F74bGfWqq6VgE8H8Zo3s', '2022-05-28 01:58:41', '2022-05-28 01:58:41'),
(4, 'Reem', 'Reem@gmail.com', '2022-05-28 01:58:41', '$2y$10$ebkSeQixAL6zf.0BdNIlUeKohej/o7Q.SOJp9QIgVfU5Y8uhm9WXm', 1, 'BO1Sm2raxv', '2022-05-28 01:58:42', '2022-05-28 01:58:42'),
(5, 'Ali', 'Ali@gmail.com', '2022-05-28 01:58:42', '$2y$10$6uy7h0PyHWclYwbo.RAg6Ov.y9WISkWfMO7BTAjakYKY43wHtbjYW', 1, 'cQlndmACPi', '2022-05-28 01:58:42', '2022-05-28 01:58:42'),
(6, 'Hamad', 'Hamad@gmail.com', '2022-05-28 01:58:42', '$2y$10$XIxCDHv3umMb/l/p0mv37ObsUBQjfAdtLkFPc6gNz9ESXhPs8rMR6', 1, 'pdPayrqAVza7nlermIYibjczl9fEx1a8F9ac7mccdVkf2QXsrhdtOPzgfuOJ', '2022-05-28 01:58:42', '2022-05-28 01:58:42'),
(7, 'Erada', 'Erada@gmail.com', '2022-05-28 01:58:42', '$2y$10$br/cLQpCjrDzfVLdE9dgRe.KLpjDBnDDQf.UgqBRgaUdKg3cX4QyG', 1, 'FLJyqlBowB', '2022-05-28 01:58:42', '2022-05-28 01:58:42'),
(8, 'Nashwan', 'Nashwan@gmail.com', '2022-05-28 01:58:42', '$2y$10$AT9cyAQ0LjHRAp5PSANoVuCgP.IWbqqTwxoJ3GvARDOnvpBxyXtva', 1, 'mCt2QifEEL', '2022-05-28 01:58:42', '2022-05-28 01:58:42'),
(9, 'Mokhtar', 'Mokhtar@gmail.com', '2022-05-28 01:58:42', '$2y$10$/FnywpcN7qlmLFDA53rUW.VECIzMIwSeMYmE4UaW9Ca.z3cPHkXDu', 1, 'NBxsCb7oDL', '2022-05-28 01:58:42', '2022-05-28 01:58:42'),
(10, 'Haitham', 'Haitham@gmail.com', '2022-05-28 01:58:42', '$2y$10$g3biG8FZcxC2Cd59kahFeey1pP1qeLCRpPH7WTrXKoHJmF3DPZZXW', 1, '0LZwQuLYxH', '2022-05-28 01:58:42', '2022-05-28 01:58:42');

-- --------------------------------------------------------

--
-- بنية الجدول `wallets`
--

CREATE TABLE `wallets` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `holder_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `holder_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `uuid` char(36) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `meta` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`meta`)),
  `balance` decimal(64,0) NOT NULL DEFAULT 0,
  `decimal_places` smallint(5) UNSIGNED NOT NULL DEFAULT 2,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `wallets`
--

INSERT INTO `wallets` (`id`, `holder_type`, `holder_id`, `name`, `slug`, `uuid`, `description`, `meta`, `balance`, `decimal_places`, `created_at`, `updated_at`) VALUES
(1, 'App\\Models\\User', 1, 'Default Wallet', 'default', '3734763b-d9af-462e-8af9-370d5f34f635', 'Non corporis occaecati quaerat modi quas qui illo commodi aut ea sunt architecto omnis aut autem incidunt aliquam assumenda dolores quis.', '[]', '10000868', 2, '1993-02-04 21:00:00', '2022-05-28 03:20:21'),
(2, 'App\\Models\\User', 2, 'Default Wallet', 'default', '56c29efc-4ae0-485c-add8-6e921879399c', 'Saepe esse ad rerum omnis quia ipsam quibusdam ipsam quod eos est harum et corporis delectus iure omnis aut qui eum ex adipisci.', '[]', '10000000', 2, '2008-03-11 21:00:00', '2011-09-19 21:00:00'),
(3, 'App\\Models\\User', 3, 'Default Wallet', 'default', '94247f75-bdec-4ad9-bc9b-38ba396f7ae0', 'Architecto numquam provident iusto repudiandae dolorum et voluptates odit natus omnis dolores possimus sapiente veritatis tenetur cupiditate rem in quidem recusandae sit ducimus explicabo.', '[]', '10000000', 2, '2005-03-03 21:00:00', '1989-04-15 21:00:00'),
(4, 'App\\Models\\User', 4, 'Default Wallet', 'default', 'ed46a7f8-b2ca-48f4-b633-c26a31906adb', 'Velit dicta sint inventore molestias quia ipsa ipsam sit saepe quidem debitis eos voluptatum id nemo labore laboriosam est est accusantium nostrum ducimus exercitationem placeat sit.', '[]', '9995658', 2, '2007-01-13 21:00:00', '2022-05-28 03:20:21'),
(5, 'App\\Models\\User', 5, 'Default Wallet', 'default', 'ce295857-db85-4a2a-83bf-db394e0aacd8', 'Voluptatibus maxime quas natus enim exercitationem similique corrupti quos dolorum dolorem velit voluptate soluta officiis recusandae corporis sint provident doloremque et molestiae.', '[]', '10000000', 2, '1986-10-23 21:00:00', '2000-07-19 21:00:00'),
(6, 'App\\Models\\User', 6, 'Default Wallet', 'default', '6b5c1189-ec29-4db8-8a2e-4b9f928569b5', 'Voluptates accusamus in quas sed iusto quae porro voluptatem enim ducimus quas enim occaecati eius inventore ducimus vitae ad et voluptas rerum possimus nemo dolores cupiditate sit voluptatem.', '[]', '10000000', 2, '1985-08-23 21:00:00', '2002-10-16 21:00:00'),
(7, 'App\\Models\\User', 7, 'Default Wallet', 'default', 'c4a4b79b-91a9-45ca-824f-0168fc445a17', 'Et sint ut distinctio sunt corrupti commodi reiciendis officia facilis earum vitae magni quo quis.', '[]', '10000000', 2, '2014-07-18 21:00:00', '2009-06-29 21:00:00'),
(8, 'App\\Models\\User', 8, 'Default Wallet', 'default', '1087f0ca-9e02-45d0-8eda-5875bcca3720', 'Dignissimos qui repellat qui rerum debitis ut voluptatem deserunt ut id ex nihil quibusdam debitis dolor rem omnis praesentium deleniti nihil est qui non facilis ea.', '[]', '10003474', 2, '2010-07-13 21:00:00', '2022-05-28 03:20:21'),
(9, 'App\\Models\\User', 9, 'Default Wallet', 'default', 'e20f4c14-e3f3-4435-b75b-1ab930f0cfbd', 'Autem harum alias perspiciatis nemo mollitia nemo ut et necessitatibus facere optio voluptatibus.', '[]', '10000000', 2, '2005-03-08 21:00:00', '1976-12-08 21:00:00'),
(10, 'App\\Models\\User', 10, 'Default Wallet', 'default', 'f4af82bc-3573-4fa5-abe3-8aeb3fd58ba2', 'Deserunt sunt qui voluptatum deserunt sit necessitatibus ratione labore similique dolore architecto consequatur eveniet quisquam necessitatibus quis odit.', '[]', '10000000', 2, '2002-07-21 21:00:00', '1982-01-06 21:00:00');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `auctions`
--
ALTER TABLE `auctions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `auctions_car_id_foreign` (`car_id`),
  ADD KEY `auctions_auctioneer_id_foreign` (`auctioneer_id`),
  ADD KEY `auctions_winner_id_foreign` (`winner_id`);

--
-- Indexes for table `bids`
--
ALTER TABLE `bids`
  ADD PRIMARY KEY (`id`),
  ADD KEY `bids_bidder_id_foreign` (`bidder_id`),
  ADD KEY `bids_auction_id_foreign` (`auction_id`);

--
-- Indexes for table `brands`
--
ALTER TABLE `brands`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cars`
--
ALTER TABLE `cars`
  ADD PRIMARY KEY (`id`),
  ADD KEY `cars_brand_id_foreign` (`brand_id`),
  ADD KEY `cars_category_id_foreign` (`category_id`),
  ADD KEY `cars_series_id_foreign` (`series_id`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `contact_us`
--
ALTER TABLE `contact_us`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `contracts`
--
ALTER TABLE `contracts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `contracts_payment_bill_id_foreign` (`payment_bill_id`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `favorites`
--
ALTER TABLE `favorites`
  ADD PRIMARY KEY (`user_id`,`auction_id`),
  ADD KEY `favorites_auction_id_foreign` (`auction_id`);

--
-- Indexes for table `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`id`),
  ADD KEY `messages_user_id_foreign` (`user_id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `notifications`
--
ALTER TABLE `notifications`
  ADD PRIMARY KEY (`id`),
  ADD KEY `notifications_user_id_foreign` (`user_id`);

--
-- Indexes for table `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Indexes for table `payment_bills`
--
ALTER TABLE `payment_bills`
  ADD PRIMARY KEY (`id`),
  ADD KEY `payment_bills_bid_id_foreign` (`bid_id`);

--
-- Indexes for table `permissions`
--
ALTER TABLE `permissions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `permissions_name_unique` (`name`);

--
-- Indexes for table `permission_role`
--
ALTER TABLE `permission_role`
  ADD PRIMARY KEY (`permission_id`,`role_id`),
  ADD KEY `permission_role_role_id_foreign` (`role_id`);

--
-- Indexes for table `permission_user`
--
ALTER TABLE `permission_user`
  ADD PRIMARY KEY (`user_id`,`permission_id`,`user_type`),
  ADD KEY `permission_user_permission_id_foreign` (`permission_id`);

--
-- Indexes for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Indexes for table `profiles`
--
ALTER TABLE `profiles`
  ADD PRIMARY KEY (`id`),
  ADD KEY `profiles_user_id_foreign` (`user_id`);

--
-- Indexes for table `questions`
--
ALTER TABLE `questions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `review_ratings`
--
ALTER TABLE `review_ratings`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `roles_name_unique` (`name`);

--
-- Indexes for table `role_user`
--
ALTER TABLE `role_user`
  ADD PRIMARY KEY (`user_id`,`role_id`,`user_type`),
  ADD KEY `role_user_role_id_foreign` (`role_id`);

--
-- Indexes for table `series`
--
ALTER TABLE `series`
  ADD PRIMARY KEY (`id`),
  ADD KEY `series_brand_id_foreign` (`brand_id`);

--
-- Indexes for table `services`
--
ALTER TABLE `services`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `transactions`
--
ALTER TABLE `transactions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `transactions_uuid_unique` (`uuid`),
  ADD KEY `transactions_payable_type_payable_id_index` (`payable_type`,`payable_id`),
  ADD KEY `payable_type_payable_id_ind` (`payable_type`,`payable_id`),
  ADD KEY `payable_type_ind` (`payable_type`,`payable_id`,`type`),
  ADD KEY `payable_confirmed_ind` (`payable_type`,`payable_id`,`confirmed`),
  ADD KEY `payable_type_confirmed_ind` (`payable_type`,`payable_id`,`type`,`confirmed`),
  ADD KEY `transactions_type_index` (`type`),
  ADD KEY `transactions_wallet_id_foreign` (`wallet_id`);

--
-- Indexes for table `transfers`
--
ALTER TABLE `transfers`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `transfers_uuid_unique` (`uuid`),
  ADD KEY `transfers_from_type_from_id_index` (`from_type`,`from_id`),
  ADD KEY `transfers_to_type_to_id_index` (`to_type`,`to_id`),
  ADD KEY `transfers_deposit_id_foreign` (`deposit_id`),
  ADD KEY `transfers_withdraw_id_foreign` (`withdraw_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- Indexes for table `wallets`
--
ALTER TABLE `wallets`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `wallets_holder_type_holder_id_slug_unique` (`holder_type`,`holder_id`,`slug`),
  ADD UNIQUE KEY `wallets_uuid_unique` (`uuid`),
  ADD KEY `wallets_holder_type_holder_id_index` (`holder_type`,`holder_id`),
  ADD KEY `wallets_slug_index` (`slug`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `auctions`
--
ALTER TABLE `auctions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT for table `bids`
--
ALTER TABLE `bids`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `brands`
--
ALTER TABLE `brands`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `cars`
--
ALTER TABLE `cars`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `contact_us`
--
ALTER TABLE `contact_us`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `contracts`
--
ALTER TABLE `contracts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `messages`
--
ALTER TABLE `messages`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1369;

--
-- AUTO_INCREMENT for table `notifications`
--
ALTER TABLE `notifications`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=158;

--
-- AUTO_INCREMENT for table `payment_bills`
--
ALTER TABLE `payment_bills`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `permissions`
--
ALTER TABLE `permissions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `profiles`
--
ALTER TABLE `profiles`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `questions`
--
ALTER TABLE `questions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `review_ratings`
--
ALTER TABLE `review_ratings`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `roles`
--
ALTER TABLE `roles`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `series`
--
ALTER TABLE `series`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `services`
--
ALTER TABLE `services`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `transactions`
--
ALTER TABLE `transactions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT for table `transfers`
--
ALTER TABLE `transfers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `wallets`
--
ALTER TABLE `wallets`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- قيود الجداول المحفوظة
--

--
-- القيود للجدول `auctions`
--
ALTER TABLE `auctions`
  ADD CONSTRAINT `auctions_auctioneer_id_foreign` FOREIGN KEY (`auctioneer_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `auctions_car_id_foreign` FOREIGN KEY (`car_id`) REFERENCES `cars` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `auctions_winner_id_foreign` FOREIGN KEY (`winner_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- القيود للجدول `bids`
--
ALTER TABLE `bids`
  ADD CONSTRAINT `bids_auction_id_foreign` FOREIGN KEY (`auction_id`) REFERENCES `auctions` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `bids_bidder_id_foreign` FOREIGN KEY (`bidder_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- القيود للجدول `cars`
--
ALTER TABLE `cars`
  ADD CONSTRAINT `cars_brand_id_foreign` FOREIGN KEY (`brand_id`) REFERENCES `brands` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `cars_category_id_foreign` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `cars_series_id_foreign` FOREIGN KEY (`series_id`) REFERENCES `series` (`id`) ON DELETE CASCADE;

--
-- القيود للجدول `contracts`
--
ALTER TABLE `contracts`
  ADD CONSTRAINT `contracts_payment_bill_id_foreign` FOREIGN KEY (`payment_bill_id`) REFERENCES `payment_bills` (`id`) ON DELETE CASCADE;

--
-- القيود للجدول `favorites`
--
ALTER TABLE `favorites`
  ADD CONSTRAINT `favorites_auction_id_foreign` FOREIGN KEY (`auction_id`) REFERENCES `auctions` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `favorites_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- القيود للجدول `messages`
--
ALTER TABLE `messages`
  ADD CONSTRAINT `messages_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- القيود للجدول `notifications`
--
ALTER TABLE `notifications`
  ADD CONSTRAINT `notifications_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- القيود للجدول `payment_bills`
--
ALTER TABLE `payment_bills`
  ADD CONSTRAINT `payment_bills_bid_id_foreign` FOREIGN KEY (`bid_id`) REFERENCES `bids` (`id`) ON DELETE CASCADE;

--
-- القيود للجدول `permission_role`
--
ALTER TABLE `permission_role`
  ADD CONSTRAINT `permission_role_permission_id_foreign` FOREIGN KEY (`permission_id`) REFERENCES `permissions` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `permission_role_role_id_foreign` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- القيود للجدول `permission_user`
--
ALTER TABLE `permission_user`
  ADD CONSTRAINT `permission_user_permission_id_foreign` FOREIGN KEY (`permission_id`) REFERENCES `permissions` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- القيود للجدول `profiles`
--
ALTER TABLE `profiles`
  ADD CONSTRAINT `profiles_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- القيود للجدول `role_user`
--
ALTER TABLE `role_user`
  ADD CONSTRAINT `role_user_role_id_foreign` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- القيود للجدول `series`
--
ALTER TABLE `series`
  ADD CONSTRAINT `series_brand_id_foreign` FOREIGN KEY (`brand_id`) REFERENCES `brands` (`id`) ON DELETE CASCADE;

--
-- القيود للجدول `transactions`
--
ALTER TABLE `transactions`
  ADD CONSTRAINT `transactions_wallet_id_foreign` FOREIGN KEY (`wallet_id`) REFERENCES `wallets` (`id`) ON DELETE CASCADE;

--
-- القيود للجدول `transfers`
--
ALTER TABLE `transfers`
  ADD CONSTRAINT `transfers_deposit_id_foreign` FOREIGN KEY (`deposit_id`) REFERENCES `transactions` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `transfers_withdraw_id_foreign` FOREIGN KEY (`withdraw_id`) REFERENCES `transactions` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
