app/Http/Controllers/user/BidController.php

    public function index(){
        try{
            $bids = Bid::where('bidder_id', Auth::id())->with('auction')->get();
---
select * from `bids` where `bidder_id` = 2