app/Http/Controllers/user/ProfilesController.php

select * from `profiles` where `user_id` = 2 limit 1
select * from `wallets` where `holder_id` = 2 limit 1
---
    public function show(){
        $route = Route::current()->getName();
        $comments= ReviewRating::where('user_id',Auth::user()->id)->get();
        $total= ReviewRating::where('user_id',Auth::user()->id)->get()->sum('star_rating');
        $count= ReviewRating::where('user_id',Auth::user()->id)->get()->count();
        if($count > 0)
        $avg=round($total/$count);
        else
        $avg=round($total/.1);

        $userProfile = Profile::where('user_id', Auth::user()->id)->first();
        $userWallet = Wallet::where('holder_id', Auth::user()->id)->first();