app/Http/Controllers/HomeController.php

select * from `users`
---
    public function users()
    {
        return User::all();