app/Http/Controllers/MessageController.php

    public function privateMessages(User $user)
    {
        $privateCommunication= Message::with('user')
        ->where(['user_id'=> auth()->id(), 'receiver_id'=> $user->id])
        ->orWhere(function($query) use($user){
            $query->where(['user_id' => $user->id, 'receiver_id' => auth()->id()]);
        })
        ->get();
---
select * from `messages` where (`user_id` = 2 and `receiver_id` = 1) or ((`user_id` = 1 and `receiver_id` = 2))
select * from `users` where `users`.`id` in (1, 2)

    public function sendPrivateMessage(Request $request,User $user)
    {
        if(request()->has('file')){
            $filename = request('file')->store('chat');
            $message=Message::create([
                'user_id' => request()->user()->id,
                'image' => $filename,
                'receiver_id' => $user->id
            ]);
        }else{
            $input=$request->all();
            $input['receiver_id']=$user->id;
            $message=auth()->user()->messages()->create($input);
        }

        broadcast(new PrivateMessageSent($message->load('user')))->toOthers();
---
insert into `messages` (`user_id`, `image`, `receiver_id`, `updated_at`, `created_at`) values (2, 'chat/yjM2ZwTGSUjwaIYrVERWKGpU5Tji1AheD6phQaXI.png', 1, '2022-05-21 03:42:34', '2022-05-21 03:42:34')
insert into `messages` (`message`, `receiver_id`, `user_id`, `updated_at`, `created_at`) values ('😀', 5, 2, '2022-05-21 03:42:54', '2022-05-21 03:42:54')
select * from `users` where `users`.`id` in (2)